[
  {
    "id": "1",
    "name": "Vex 9",
    "description": "Vex 9 is here - the next evolution in the legendary stickman platformer series! Take your parkour skills to the limit as you run, jump, and slide your way through a brand-new set of Acts filled with dangerous traps, bombs, and other deadly surprises. For the first time ever, take to the skies with the powerful new Jetpack! Put your reflexes to the ultimate test in the all-new Challenge Mode! Can you conquer every challenge and become the ultimate Vex champion?",
    "url": "https://html5.gamedistribution.com/8d034584a63642dcb89fa3d24ed6e1b1/?gd_sdk_referrer_url=https://gamedistribution.com/games/vex-9/",
    "icon": "https://img.gamedistribution.com/8d034584a63642dcb89fa3d24ed6e1b1-512x384.jpg",
    "category": "action"
  },
  {
    "id": "2",
    "name": "ASMR Pet Treatment",
    "description": "Take care of your adorable puppy and kitty in this relaxing ASMR game! Wash, heal, and pamper your pets with gentle treatments. After they feel happy and healthy, have fun dressing them up in cute outfits. Relaxing sounds and sweet pets make every moment enjoyable!",
    "url": "https://html5.gamedistribution.com/b8075d28037148ec9764c96e3be18bfc/?gd_sdk_referrer_url=https://gamedistribution.com/games/asmr-pet-treatment/",
    "icon": "https://img.gamedistribution.com/b8075d28037148ec9764c96e3be18bfc-512x384.jpg",
    "category": "casual"
  },
  {
    "id": "3",
    "name": "Cookie Land",
    "description": "Step into Cookie Land, the ultimate sweet Match 3 adventure! Match cookies, candies, pies, donuts, cupcakes, and cotton candies to clear the board and trigger scrumptious chain reactions. Explore a fairytale-like saga map filled with colorful sweets, charming graphics, and a catchy soundtrack. With new treats raining down and endless levels of fun, Cookie Land is the most addictive, mouth-watering Match 3 game for all sweet lovers!",
    "url": "https://html5.gamedistribution.com/bb4d392023214827884f92b2a0d68c27/?gd_sdk_referrer_url=https://gamedistribution.com/games/cookie-land/",
    "icon": "https://img.gamedistribution.com/bb4d392023214827884f92b2a0d68c27-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "4",
    "name": "Bubble Shooter Temple Jewels",
    "description": "Embark on a temple adventure in Bubble Shooter Temple Jewels! Pop colorful bubbles as you progress through ancient ruins inspired by Central American temples. Keep track of your journey with the Stats screen, showing your best, current, and previous scores across Novice, Expert, and Master modes. With vibrant visuals, exciting challenges, and detailed progress tracking, this bubble shooter keeps you motivated to aim higher and improve every round!",
    "url": "https://html5.gamedistribution.com/8b43e10dbeb84f7c90e848fb8109d489/?gd_sdk_referrer_url=https://gamedistribution.com/games/bubble-shooter-temple-jewels/",
    "icon": "https://img.gamedistribution.com/8b43e10dbeb84f7c90e848fb8109d489-512x512.jpg",
    "category": "arcade"
  },
  {
    "id": "5",
    "name": "Kings and Queens Mahjong",
    "description": "Enter the magical Royal Kingdom in Kings & Queens Mahjong! Match pairs of jewels, crowns, and other royal treasures to clear the board and climb the Royal Leaderboard. Race against the clock, use boosters like Hint, Shuffle, and Undo when needed, and enjoy handcrafted tiles with a majestic design. Perfect for puzzle lovers looking for a royal challenge!",
    "url": "https://html5.gamedistribution.com/0833c488e0364b15a9feab146f522ddc/?gd_sdk_referrer_url=https://gamedistribution.com/games/kings-and-queens-mahjong/",
    "icon": "https://img.gamedistribution.com/0833c488e0364b15a9feab146f522ddc-512x512.jpg",
    "category": "puzzle"
  },
  
  {
    "id": "6",
    "name": "Hawaii Match 5",
    "description": "Escape to the paradise in Hawaii Match 5! Explore dreamlike landscapes while matching exotic fruits and flowers. With over 4000+ levels, complete challenging goals in limited moves by forming rows of five or more symbols. Unlock powerful boosters and combine symbols for explosive bonuses. Discover hidden treasures and let your soul unwind in this captivating island adventure. Play Hawaii Match 5 now and enjoy endless fun!",
    "url": "https://html5.gamedistribution.com/bfd9e939e8cd458fbb03df9b598959f4/?gd_sdk_referrer_url=https://gamedistribution.com/games/hawaii-match-5/#iss=https%3A%2F%2Fidp.azerionconnect.com%2Fauth%2Frealms%2Fazerion",
    "icon": "https://img.gamedistribution.com/bfd9e939e8cd458fbb03df9b598959f4-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "7",
    "name": "Minecraft Battle Party",
    "description": "Ready for a hot feast of square battles? In Minecraft Battle Party, you'll enter a pixel-styled battle arena where nervous fighting meets iconic Minecraft-style visuals. In this world, every game is a duel to the death. You will play different roles and use different weapons. For example, as a gunner, constantly move your character so that enemies are shot within your scanning range. Watch out for other people's attacks.",
    "url": "https://html5.gamedistribution.com/61217cb6c59e49a29ad154c64ea209de/?gd_sdk_referrer_url=https://gamedistribution.com/games/minecraft-battle-party/",
    "icon": "https://img.gamedistribution.com/61217cb6c59e49a29ad154c64ea209de-512x384.jpg",
    "category": "action"
  },
  {
    "id": "8",
    "name": "Woody Hexa",
    "description": "Woody Hexa is a visually engaging puzzle game that challenges players to complete 250 levels by strategically arranging hexagonal blocks by color. With simple drag-and-drop controls and increasingly complex layouts, each level tests your logic and spatial awareness. Combining relaxing gameplay with clever merging mechanics, Woody Hexa offers a satisfying brain workout perfect for all ages.",
    "url": "https://html5.gamedistribution.com/082c45e1e26f49a2b8ab70fa7aa6b3b7/?gd_sdk_referrer_url=https://gamedistribution.com/games/woody-hexa/",
    "icon": "https://img.gamedistribution.com/082c45e1e26f49a2b8ab70fa7aa6b3b7-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "9",
    "name": "Magic Tiles 3",
    "description": "Love music games? Play your favorite songs on Piano Magic Tiles 3! Magic Tiles 3 is an engaging music game that combines magic piano, rhythm, and games for a fun and immersive experience. Tap the tiles to the beat, challenge your reflexes, and enjoy a massive library of 45,000+ songs across various genres, pop, EDM, hip-hop, and more! Tap the black tiles to the rhythm while avoiding the white ones.",
    "url": "https://html5.gamedistribution.com/58deefb8f63943dcbc5093070b9b5777/?gd_sdk_referrer_url=https://gamedistribution.com/games/magic-tiles-3/",
    "icon": "https://img.gamedistribution.com/58deefb8f63943dcbc5093070b9b5777-512x384.jpg",
    "category": "music"
  },
  {
    "id": "10",
    "name": "Sort Tiles",
    "description": "Sort Tiles: Tap Away is a fun and addictive puzzle game where you move tiles, clear the board, and reveal hidden pictures. It’s simple to learn but offers endless logic challenges that keep your brain active. Perfect for fans of tile puzzles, logic games, and relaxing brain teasers. Key Features: Unique puzzle mechanics — move tiles in the arrow’s direction and solve logic puzzles step by step. Hidden images — every cleared puzzle board reveals a new picture.",
    "url": "https://html5.gamedistribution.com/5d6e368f1b55466aa897cb7f0c67419c/?gd_sdk_referrer_url=https://gamedistribution.com/games/sort-tiles/",
    "icon": "https://img.gamedistribution.com/5d6e368f1b55466aa897cb7f0c67419c-512x384.jpg",
    "category": "puzzle"
  },
{
    "id": "11",
    "name": "Twilight Solitaire TriPeaks",
    "description": "Step into the shadows with Twilight Solitaire TriPeaks! Explore abandoned castles, fend off lurking vampires, and rebuild forgotten halls. Play 200+ haunting Solitaire levels plus 50 chilling Mahjong boards. Face spooky twists like frozen and locked cards, tricky obstacles, and powerful boosts. Search the dark, cobwebby corners of every last level for gems and coins to purchase new castle upgrades and power-ups. Are you ready for a Solitaire adventure that sends shivers down your spine?",
    "url": "https://html5.gamedistribution.com/91eb12a4669543ea825a9e2469143b93/?gd_sdk_referrer_url=https://gamedistribution.com/games/twilight-solitaire-tripeaks/",
    "icon": "https://img.gamedistribution.com/91eb12a4669543ea825a9e2469143b93-512x384.jpg",
    "category": "card"
  },
  {
    "id": "12",
    "name": "Cooking Restaurant Kitchen",
    "description": "Prepare and cook delicious food from all over the world in Cooking Restaurant Kitchen. Build the cafe of your dreams while serving hot and awesome meals to hungry customers at a fast pace! Don't let the time run out, practice your time management skills, and get ready to experience the craze of real cooking!",
    "url": "https://html5.gamedistribution.com/755f3912501d454fb781db0a4c0c5764/?gd_sdk_referrer_url=https://gamedistribution.com/games/cooking-restaurant-kitchen/",
    "icon": "https://img.gamedistribution.com/755f3912501d454fb781db0a4c0c5764-512x384.jpeg",
    "category": "cooking"
  },
  {
    "id": "13",
    "name": "Formula Traffic Racer",
    "description": "Skid the wheels of 6 stunning F1 cars with modified body kits and drive them through 3 landscape highways without crashing. Show how well you can steer the wheels of these amazing cars with roaring engines and conquer 3 awesome game modes. Use replenishing nitro to overtake slow cars and drive in speed at all times. Customize and upgrade your cars with the best upgrades and get the most out of all the cars. Are you ready to show your driving skills? Prove yourself in F1 Traffic Racer.",
    "url": "https://html5.gamedistribution.com/940c7c7f620b46f0ba61998e9a98b8fb/?gd_sdk_referrer_url=https://gamedistribution.com/games/formula-traffic-racer/",
    "icon": "https://img.gamedistribution.com/940c7c7f620b46f0ba61998e9a98b8fb-512x384.jpg",
    "category": "racing"
  },
  {
    "id": "14",
    "name": "Cat Life Simulator: Devil Cat",
    "description": "Ever wanted to experience life as a mischievous cat? In Cat Life Simulator: Devil Cat, you take on the role of a playful yet naughty kitty, causing absolute mayhem inside Grandma’s house—all from a first-person perspective! This exciting 3D simulation game lets you see through the eyes of a troublemaking feline as you knock over furniture, scratch walls, and do everything in your power to drive Grandma crazy! Are you ready to embrace the chaos?",
    "url": "https://html5.gamedistribution.com/61444bd7cc1d42dc9e50d8ea31235f1e/?gd_sdk_referrer_url=https://gamedistribution.com/games/cat-life-simulator:-devil-cat/",
    "icon": "https://img.gamedistribution.com/61444bd7cc1d42dc9e50d8ea31235f1e-1280x720.jpg",
    "category": "simulation"
  },
  {
    "id": "15",
    "name": "Merge Hospital",
    "description": "Play as Doctor Player in Merge Hospital and discover the many secrets of your staff members, and what is happening in and around the Hospital. In Merge Hospital by Operate Now you will merge and build, meet and love many skilled surgeons, doctors and other interesting characters. You will learn more about their stories and how they got into the hospital. As Dr. Player you must: MERGE medical items, pies and much more! DISCOVER the story of a medical drama like in your favorite TV shows.",
    "url": "https://html5.gamedistribution.com/34228dc4cd784e43857cc4c678a83984/?gd_sdk_referrer_url=https://gamedistribution.com/games/merge-hospital/",
    "icon": "https://img.gamedistribution.com/34228dc4cd784e43857cc4c678a83984-512x384.jpg",
    "category": "simulation"
  },
  {
    "id": "16",
    "name": "Obby Tower",
    "description": "Climb. Think. Survive. Ascend a towering obstacle course filled with tricky jumps, moving platforms — and surprise math challenges! Combine your parkour skills with quick thinking to make it to the top. Perfect for players who love obbies and want to test both reflexes and brainpower.",
    "url": "https://html5.gamedistribution.com/62e8b351034b46129fedb50065e06680/?gd_sdk_referrer_url=https://gamedistribution.com/games/obby-tower/",
    "icon": "https://img.gamedistribution.com/62e8b351034b46129fedb50065e06680-512x384.jpg",
    "category": "adventure"
  },
  {
    "id": "17",
    "name": "Mini Golf Battle",
    "description": "Mini Golf Battle is a casual sports puzzle where precision and timing decide the outcome. Your task is to sink the ball into the hole with the fewest strokes possible while navigating ramps, walls, and tricky obstacles. Special power-ups like Fire, Wing, and Spring shots add variety, letting you approach each course with unique strategies. Whether for short play sessions or longer runs, Mini Golf Battle delivers an engaging mix of relaxation and skillful play.",
    "url": "https://html5.gamedistribution.com/f13a0ab3316c4be8b273610a5f2c872c/?gd_sdk_referrer_url=https://gamedistribution.com/games/mini-golf-battle/",
    "icon": "https://img.gamedistribution.com/f13a0ab3316c4be8b273610a5f2c872c-512x384.jpg",
    "category": "sports"
  },
  {
    "id": "18",
    "name": "LinkLink",
    "description": "Round and cute animal blocks are piled up. If you connect the same types together, you can get points by disappearing! Let's compete to see who gets the highest score in a minute!",
    "url": "https://html5.gamedistribution.com/e399b210de7d4db9a5ab7334c5fa0c1b/?gd_sdk_referrer_url=https://gamedistribution.com/games/linklink/",
    "icon": "https://img.gamedistribution.com/e399b210de7d4db9a5ab7334c5fa0c1b-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "19",
    "name": "Dog Escape",
    "description": "Welcome to Dog Escape, the hide-and-seek puzzle where saving a dog is only the beginning. Guide a lost canine through traps and guards, then bring it home to cuddle, feed, and style! If you adore puppy-care, dress-up, and dog games with heart, this is your new daily ritual. Rescue your puppies now!",
    "url": "https://html5.gamedistribution.com/023e7fbb9c874166a76219e0c1f45af0/?gd_sdk_referrer_url=https://gamedistribution.com/games/dog-escape-1/",
    "icon": "https://img.gamedistribution.com/023e7fbb9c874166a76219e0c1f45af0-512x384.jpg",
    "category": "adventure"
  },
  {
    "id": "20",
    "name": "VEX Challenges",
    "description": "Put your skills to the test in Vex Challenges, the newest online Vex game where the timer counts down instead of up. Try to get to the finish within the allotted time, and don’t forget to pick up the stars on the way! Vex Challenges is just as gripping and thrilling as before, but includes a brand new way to play. The game includes 75 custom levels, a hidden Challenge Mode, new skins and a soundtrack that evolves as you progress. It’s Vex like you’ve never seen before!",
    "url": "https://html5.gamedistribution.com/b657d0d7da2e46919d24862aa1f3e758/?gd_sdk_referrer_url=https://gamedistribution.com/games/vex-challenges/",
    "icon": "https://img.gamedistribution.com/b657d0d7da2e46919d24862aa1f3e758-512x384.jpeg",
    "category": "action"
  },


  {
    "id": "21",
    "name": "Aliens Hunter",
    "description": "You are an alien hunter and your mission is to use your abilities to find the aliens hidden in the city and use your gun to accurately shoot the aliens to get rewards. Each round has different aliens hiding in different locations. You have to accurately choose, aim and shoot to complete the level mission.",
    "url": "https://html5.gamedistribution.com/6259b8781bfe4a1dbcd274ca61837902/?gd_sdk_referrer_url=https://gamedistribution.com/games/aliens-hunter/",
    "icon": "https://img.gamedistribution.com/6259b8781bfe4a1dbcd274ca61837902-512x512.jpg",
    "category": "action"
  },
  {
    "id": "22",
    "name": "Car Mechanic Simulator",
    "description": "In \"Car Mechanic Simulator 2025\", you are a master restorer who breathes new life into forgotten cars! Your task is to find old, broken, and abandoned cars, disassemble them down to the last screw, repair them, replace parts, and reassemble them, turning rusty piles of metal into shiny legends of the automotive industry. Search for rare spare parts, restore engines, choose the perfect paint, and bring every detail to perfection.",
    "url": "https://html5.gamedistribution.com/b3d496aa204043c7bb39a355d8c97235/?gd_sdk_referrer_url=https://gamedistribution.com/games/car-mechanic-simulator-2025/",
    "icon": "https://img.gamedistribution.com/b3d496aa204043c7bb39a355d8c97235-512x512.jpg",
    "category": "simulation"
  },
  {
    "id": "23",
    "name": "Merge Beasts",
    "description": "A fun and addictive merge game where you combine cute and quirky beasts to create stronger and rarer creatures. Each merge brings you closer to discovering powerful evolutions and unlocking new surprises. Collect coins, upgrade your beasts, and watch your monster city grow!",
    "url": "https://html5.gamedistribution.com/28f14620b6b4490b8ca14b5ebc684175/?gd_sdk_referrer_url=https://gamedistribution.com/games/merge-beasts/",
    "icon": "https://img.gamedistribution.com/28f14620b6b4490b8ca14b5ebc684175-512x512.jpg",
    "category": "puzzle"
  },
  {
    "id": "24",
    "name": "Noob: parkour tricks",
    "description": "Welcome to Noob: Parkour tricks! This is a runner and timekiller in the minecraft universe about the adventures of Noob. Do parkour tricks and complete challenges. Monster School kicked out Noob, and Herobrine turned him into a Gigachad! Game Features: - Run through the village with trials. - Do parkour tricks. - Complete challenges and avoid traps. - Collect diamonds. - Unlock new skins.",
    "url": "https://html5.gamedistribution.com/f97244f04ed44f83bdae1f71c02361cb/?gd_sdk_referrer_url=https://gamedistribution.com/games/noob:-parkour-tricks/",
    "icon": "https://img.gamedistribution.com/f97244f04ed44f83bdae1f71c02361cb-512x384.jpg",
    "category": "action"
  },
  {
    "id": "25",
    "name": "What's In My Bag?",
    "description": "Unpack style and surprises in What's In My Bag? – the ultimate dress-up and makeup game for fashion lovers! Choose cute outfits, glam makeup, and trendy bags, then reveal what's inside each one. From influencer props to girly goodies, every bag tells a story. Get creative, show off your style, and join the viral \"what's in my bag\" trend now! Perfect for fans of dress-up games, makeup fun, and aesthetic vibes.",
    "url": "https://html5.gamedistribution.com/25ed0a49c8414d8fbd16cbee344b8e5d/?gd_sdk_referrer_url=https://gamedistribution.com/games/what's-in-my-bag/",
    "icon": "https://img.gamedistribution.com/25ed0a49c8414d8fbd16cbee344b8e5d-512x384.jpg",
    "category": "casual"
  },
  {
    "id": "26",
    "name": "Legend of Fireball",
    "description": "Fireballs are your weapon of choice as you tap on objects to obliterate them and earn rewards. Every tap brings you closer to becoming the ultimate Fireball King! Collect various fireballs, costumes, and upgrades, enhancing your powers with every victory. Master cool fireball skills to crush objects even faster and more efficiently. Race against time to demolish all targets in thrilling challenges, proving you're the strongest fireball wielder in the universe!",
    "url": "https://html5.gamedistribution.com/cadf585751cf43dfbc12aa1092186855/?gd_sdk_referrer_url=https://gamedistribution.com/games/legend-of-fireball/",
    "icon": "https://img.gamedistribution.com/cadf585751cf43dfbc12aa1092186855-512x384.jpg",
    "category": "action"
  },
  {
    "id": "27",
    "name": "Tales of Lagoona",
    "description": "Embark on a magical Hidden Object adventure beneath the waves! In Coral Bay, the New Anemone Orphanage is in danger of closing – only you can save it. Search beautiful underwater scenes for hidden treasures, sell your finds at the market, upgrade the orphanage, play 160 mini-games, and take on quests from the townsfolk. Join Islabelle the Mermaid in a heartwarming quest to rescue the orphans!",
    "url": "https://html5.gamedistribution.com/93630196f06f465995df303524c3e706/?gd_sdk_referrer_url=https://gamedistribution.com/games/tales-of-lagoona/",
    "icon": "https://img.gamedistribution.com/93630196f06f465995df303524c3e706-512x512.jpg",
    "category": "puzzle"
  },
  {
    "id": "28",
    "name": "K-Pop Hunter Halloween Fashion",
    "description": "Step into the glamorous world of K-Pop Hunter Halloween Fashion! In this fun dress-up game, you become the ultimate stylist, creating spooky yet stylish looks for popular K-Pop stars. Mix and match Halloween costumes, trendy hairstyles, and cool accessories to design jaw-dropping outfits for the season's most exciting event.",
    "url": "https://html5.gamedistribution.com/7b34855c2eb74532925de32ab10a97d5/?gd_sdk_referrer_url=https://gamedistribution.com/games/k-pop-hunter-halloween-fashion/",
    "icon": "https://img.gamedistribution.com/7b34855c2eb74532925de32ab10a97d5-512x384.jpg",
    "category": "casual"
  },
  {
    "id": "29",
    "name": "Grunge Chic Alt Fashion",
    "description": "Step into the edgy world of Grunge Chic Alt Fashion, where style meets attitude. This dress-up game lets you explore the perfect mix of grunge edge and chic sophistication. From plaid skirts and ripped jeans to oversized jackets, fishnets, and combat boots—you'll have endless options to design your alternative fashion star. Top it off with smoky makeup, bold lipstick, and layered accessories to complete the vibe.",
    "url": "https://html5.gamedistribution.com/78eb21dc67c744fe8ae7fcf97a69d868/?gd_sdk_referrer_url=https://gamedistribution.com/games/grunge-chic-alt-fashion/",
    "icon": "https://img.gamedistribution.com/78eb21dc67c744fe8ae7fcf97a69d868-512x384.jpg",
    "category": "casual"
  },
  {
    "id": "30",
    "name": "Idle Factory Domination",
    "description": "Embark on a journey of industrial dominance in Idle Factory Domination. Click on cells to purchase land, invest in businesses and resources to initiate production, and steadily expand your empire to unlock new territories, all while amassing wealth and asserting your manufacturing prowess.",
    "url": "https://html5.gamedistribution.com/7d900e290aa649859e4780e429323fbc/?gd_sdk_referrer_url=https://gamedistribution.com/games/idle-factory-domination/",
    "icon": "https://img.gamedistribution.com/7d900e290aa649859e4780e429323fbc-1280x720.jpg",
    "category": "simulation"
  },
  {
    "id": "31",
    "name": "Hexa Sort Trick or Treat",
    "description": "Step into a haunted puzzle realm where glowing hexagonal blocks hide within a web of spooky challenges. Your task: sort eerie, color-coded pieces into their rightful places before the shadows close in. With every drag and drop, you'll sharpen your wits and unravel chillingly clever layouts that grow trickier as you progress. Easy to pick up yet devilishly addictive, this Halloween brain-teaser will keep players of all ages spellbound through hundreds of spooky levels.",
    "url": "https://html5.gamedistribution.com/66fddb2022464fce86e045f78db3f46d/?gd_sdk_referrer_url=https://gamedistribution.com/games/hexa-sort-trick-or-treat/",
    "icon": "https://img.gamedistribution.com/66fddb2022464fce86e045f78db3f46d-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "32",
    "name": "Rock Crawling",
    "description": "Welcome to the thrilling world of 3D Rock Crawling Racing, where speed meets strategy and off-road dominance is your only goal. In this high-adrenaline off-road simulator, players take the wheel of powerful 4x4 rock crawlers and navigate some of the most extreme and rugged terrains ever designed in a browser game. From sharp mountain ridges to slippery mud tracks, this is not your average racing game—it's a true test of control, timing, and grit.",
    "url": "https://html5.gamedistribution.com/76f026c1a1054c38b62a350e7bed02bc/?gd_sdk_referrer_url=https://gamedistribution.com/games/rock-crawling/",
    "icon": "https://img.gamedistribution.com/76f026c1a1054c38b62a350e7bed02bc-512x384.jpg",
    "category": "racing"
  },
  {
    "id": "33",
    "name": "Elytra Flight",
    "description": "Elytra Flight is an endless flying adventure inspired by the legendary Elytra wings. Players take to the skies in a fast-paced challenge where reflexes and strategy decide how long they can survive. Whether solo or in 2 player mode, the game blends arcade action with survival mechanics, offering a fresh and rewarding experience every flight.",
    "url": "https://html5.gamedistribution.com/82f6fa2fa66c47b3a0f2b0543cbdfc43/?gd_sdk_referrer_url=https://gamedistribution.com/games/elytra-flight/",
    "icon": "https://img.gamedistribution.com/82f6fa2fa66c47b3a0f2b0543cbdfc43-512x512.jpg",
    "category": "action"
  },
  {
    "id": "34",
    "name": "Among Us Smash",
    "description": "Among Us Smash is a game with Among Us balloons. There is different colors on among us balloons and you need to smash it. Smash all balloons except the blue balloons. You have the right to smash the blue balloons three times. After that the game will end. Be careful because sometimes the balloons come in a group of several balloons and there is a blue balloon hidden between them, so when you smash the others, the blue one will smash as well. Smash as many balloons as you can and get the best result.",
    "url": "https://html5.gamedistribution.com/e08d7d5f87d340cbb1e7a078ee8ff704/?gd_sdk_referrer_url=https://gamedistribution.com/games/among-us-smash/",
    "icon": "https://img.gamedistribution.com/e08d7d5f87d340cbb1e7a078ee8ff704-512x512.jpeg",
    "category": "casual"
  },
  {
    "id": "35",
    "name": "Among Impostor Mahjong Connect",
    "description": "Connect all the among us impostor mahjong tiles and clear the board in this html5 mahjong connection games. You can only connect 2 tiles with the same items with a path with no more than two 90 degree angles. What's the max level can you play?",
    "url": "https://html5.gamedistribution.com/e99c3122c3814c3e95bfb9162030b922/?gd_sdk_referrer_url=https://gamedistribution.com/games/among-impostor-mahjong-connect/",
    "icon": "https://img.gamedistribution.com/e99c3122c3814c3e95bfb9162030b922-512x384.jpeg",
    "category": "puzzle"
  },
  {
    "id": "36",
    "name": "Sprunki Monster Music Beats",
    "description": "Sprunki Monster Music Beats is a music game where popular characters create unique compositions. Combine sounds, create melodies, and enjoy!",
    "url": "https://html5.gamedistribution.com/079570fb4e17431c931dc5f11d4e1886/?gd_sdk_referrer_url=https://gamedistribution.com/games/sprunki-monster-music-beats/",
    "icon": "https://img.gamedistribution.com/079570fb4e17431c931dc5f11d4e1886-512x384.jpg",
    "category": "casual"
  },
  {
    "id": "37",
    "name": "Battle Royale Puzzle Challenge",
    "description": "Battle Royale Puzzle Challenge is a perfect choice for jigsaw puzzle lovers This game is about the famous Fortnite Battle Royale game and it gives you the perfect jigsaw puzzle experience Solve all puzzles and keep your brain sharp You have fur modes for each picture easy medium and hard There is no time limit so you can have a leisurely experience Have fun playing",
    "url": "https://html5.gamedistribution.com/0e462cb3e0804b4dbb34878b7bd1c17e/?gd_sdk_referrer_url=https://gamedistribution.com/games/battle-royale-puzzle-challenge/",
    "icon": "https://img.gamedistribution.com/0e462cb3e0804b4dbb34878b7bd1c17e-512x384.jpeg",
    "category": "puzzle"
  },
  {
    "id": "38",
    "name": "Minecraft Battle Party",
    "description": "Ready for a hot feast of square battles? In Minecraft Battle Party, you'll enter a pixel-styled battle arena where nervous fighting meets iconic Minecraft-style visuals. In this world, every game is a duel to the death. You will play different roles and use different weapons. For example, as a gunner, constantly move your character so that enemies are shot within your scanning range. Watch out for other people's attacks.",
    "url": "https://html5.gamedistribution.com/61217cb6c59e49a29ad154c64ea209de/?gd_sdk_referrer_url=https://gamedistribution.com/games/minecraft-battle-party/",
    "icon": "https://img.gamedistribution.com/61217cb6c59e49a29ad154c64ea209de-512x384.jpg",
    "category": "action"
  },
  {
    "id": "39",
    "name": "Kingdom Defence: Mercenary",
    "description": "This Tower Defence game \"Kingdom Defence: Mercenary\" is the combination of War Games, Magic Weapons, Castle and Guardians with mission of protect The Kingdom and against the aggression of Monster. Your Kingdom is under attack by fearful Monster. In this Tower Defense, you need to react fast and use the right weapons in order to win one of War Games.",
    "url": "https://html5.gamedistribution.com/5c7a89fe84664d79ad57c1a48232c724/?gd_sdk_referrer_url=https://gamedistribution.com/games/kingdom-defence-mercenary/",
    "icon": "https://img.gamedistribution.com/5c7a89fe84664d79ad57c1a48232c724-512x384.jpeg",
    "category": "strategy"
  },
  {
    "id": "40",
    "name": "Ludo Hero",
    "description": "Ludo Hero, modern version of the royal game of Pachisi has arrived. It's a game which was played among Indian kings and queens in ancient times. Roll the Ludo dice and move your tokens to reach the center of the Ludo board. Beat other opponents and become the king of Ludo in this multiplayer game. No complicated login screens. Just enter your username and play against the world. Play with your friends in a 2-player or 4-player mode.",
    "url": "https://html5.gamedistribution.com/951d399995cc4ea5a528c9b7e873066b/?gd_sdk_referrer_url=https://gamedistribution.com/games/ludo-hero/",
    "icon": "https://img.gamedistribution.com/951d399995cc4ea5a528c9b7e873066b-512x384.jpeg",
    "category": "board"
  },
  {
    "id": "41",
    "name": "Patterns",
    "description": "Help Ellie recreate magical patterns using grass, fire, clouds, and more elements as you uncover the hidden order of each level.",
    "url": "https://html5.gamedistribution.com/d2469e2bac9247108bd72573893b76fe/?gd_sdk_referrer_url=https://gamedistribution.com/games/patterns/",
    "icon": "https://img.gamedistribution.com/d2469e2bac9247108bd72573893b76fe-512x512.jpg",
    "category": "puzzle"
  },
  {
    "id": "42",
    "name": "FG Ludo",
    "description": "FG Ludo is fun addictive puzzle game.If you love ludo and want some twist. This game is for you. so enjoy the game.",
    "url": "https://html5.gamedistribution.com/daf0e2fee49d46848145391825c45831/?gd_sdk_referrer_url=https://gamedistribution.com/games/fg-ludo/",
    "icon": "https://img.gamedistribution.com/daf0e2fee49d46848145391825c45831-512x384.jpeg",
    "category": "board"
  },
  {
    "id": "43",
    "name": "Just Ludo",
    "description": "Just Ludo is a tabletop dice board game. Roll the dice and let your chess pieces reach the finish line first, so as to defeat the opponent and win rich rewards. Are you ready for the challenge?",
    "url": "https://html5.gamedistribution.com/a6221e83c05947c198e681edcf5be3d9/?gd_sdk_referrer_url=https://gamedistribution.com/games/just-ludo/",
    "icon": "https://img.gamedistribution.com/a6221e83c05947c198e681edcf5be3d9-512x384.jpg",
    "category": "board"
  },
{
    "id": "44",
    "name": "Battle Royale Puzzle Challenge",
    "description": "Battle Royale Puzzle Challenge is a perfect choice for jigsaw puzzle lovers This game is about the famous Fortnite Battle Royale game and it gives you the perfect jigsaw puzzle experience Solve all puzzles and keep your brain sharp You have fur modes for each picture easy medium and hard There is no time limit so you can have a leisurely experience Have fun playing",
    "url": "https://html5.gamedistribution.com/0e462cb3e0804b4dbb34878b7bd1c17e/?gd_sdk_referrer_url=https://gamedistribution.com/games/battle-royale-puzzle-challenge/",
    "icon": "https://img.gamedistribution.com/0e462cb3e0804b4dbb34878b7bd1c17e-512x384.jpeg",
    "category": "puzzle"
  },
  {
    "id": "45",
    "name": "Crocodilo Tralalero Run",
    "description": "Crocodilo Tralalero Run is a fast-paced platformer where your Crazy fiends runs forward automatically, and you must jump, dodge obstacles, defeat enemies, and collect coins. Unlock and customize your Crazy fiends in the shop to enhance your adventure. With its exciting gameplay and charming rewards, Crocodilo, Tralalero, Tsung Tsung and others characters offers fun for all ages!",
    "url": "https://html5.gamedistribution.com/e5b212419e8d459da7d97596a575ef75/?gd_sdk_referrer_url=https://gamedistribution.com/games/crocodilo-tralalero-run/",
    "icon": "https://img.gamedistribution.com/e5b212419e8d459da7d97596a575ef75-512x384.jpg",
    "category": "action"
  },
  {
    "id": "46",
    "name": "Blocky Blast",
    "description": "Blocky Blast is a puzzle game A match is made when the player touches one of the color blocks that has at least one neighbor of the same color",
    "url": "https://html5.gamedistribution.com/2e749fbaa6c94e1ebb7c2c04abfc5f06/?gd_sdk_referrer_url=https://gamedistribution.com/games/blocky-blast/",
    "icon": "https://img.gamedistribution.com/2e749fbaa6c94e1ebb7c2c04abfc5f06-512x512.jpeg",
    "category": "puzzle"
  },
  {
    "id": "47",
    "name": "Bubble Shooter Witch Tower 2",
    "description": "Bubble Shooter: Witch Tower 2 brings back the magic in a fun, family-friendly way! Pop colorful bubbles, unlock cozy enchanted rooms, and help the Witch Tower shine again. Meet adorable familiars, enjoy charming details, and celebrate the magic of every season — even a touch of Halloween spookiness! Easy to play for all ages, with plenty of bubble-shooting fun to enjoy anytime.",
    "url": "https://html5.gamedistribution.com/c11581c478694906b1246632b264dff1/?gd_sdk_referrer_url=https://gamedistribution.com/games/bubble-shooter-witch-tower-2/",
    "icon": "https://img.gamedistribution.com/c11581c478694906b1246632b264dff1-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "48",
    "name": "Water Junk Warriors",
    "description": "Water Junk Warriors is a vibrant eco-adventure game where players dive into polluted waterways to clean up human-made junk and restore the natural balance of riverbanks, beaches, and urban canals. Armed with clever tools and a passion for nature, players collect floating trash, unlock animated milestones, and witness the environment come back to life, one subgoal at a time.",
    "url": "https://html5.gamedistribution.com/3fa4363aedb34131a46ce4aa0f36eab2/?gd_sdk_referrer_url=https://gamedistribution.com/games/water-junk-warriors/",
    "icon": "https://img.gamedistribution.com/3fa4363aedb34131a46ce4aa0f36eab2-512x384.jpg",
    "category": "casual"
  },
  {
    "id": "49",
    "name": "Flappy Bird Game with a Twist",
    "description": "Play Now, the latest twist on the regular flappy bird game. In the latest update, the birdie can shoot the obstacles away from the path. And what more, there are 2 modes, the classic mode and the villain mode. Choose and play. This is not another Flappy Bird Game! There are challenges. This game is easier to play but tougher to score. Are you up for the challenge? #flapshootbirdie? Select from the 4 available birdie characters and enjoying playing this different take on the flappy bird game.",
    "url": "https://html5.gamedistribution.com/071899b13b934ed29d865dfe0c741793/?gd_sdk_referrer_url=https://gamedistribution.com/games/play-tap-enjoy-not-just-a-flappy-bird-game/",
    "icon": "https://img.gamedistribution.com/071899b13b934ed29d865dfe0c741793-512x512.jpeg",
    "category": "arcade"
  },
  {
    "id": "50",
    "name": "Fly Fly Fly",
    "description": "Fly Fly Fly is a Flappy Bird alike game, where you have to fly through 30 different levels, avoiding obstacles an collecting berries. If you hit the ground it will be game over, if you crash on one of the earth worms around the level, you will lose a life. If you lost all your lives, it's game over. You can restore your health collecting the berries you will find around the level. Do your best and beat all the 30 levels and show the world what you really are!",
    "url": "https://html5.gamedistribution.com/96ab76bfdfbd472aad509cc7b278d8ce/?gd_sdk_referrer_url=https://gamedistribution.com/games/fly-fly-fly/",
    "icon": "https://img.gamedistribution.com/96ab76bfdfbd472aad509cc7b278d8ce-512x512.jpg",
    "category": "arcade"
  },
  {
    "id": "51",
    "name": "Square Punki Long Hand",
    "description": "Ever wondered what life would be like with super long arms? In Square Punki Long Hand, you get to experience just that! This unique puzzle game challenges you to stretch, grab, prank, and solve hilarious puzzles using your extra-long limbs. Whether you're rescuing trapped characters, reaching impossible places, or pulling off mischievous tricks, every level is filled with surprises and laughter!",
    "url": "https://html5.gamedistribution.com/9cdad5a9a02b4a6daec83566092951ff/?gd_sdk_referrer_url=https://gamedistribution.com/games/square-punki-long-hand/",
    "icon": "https://img.gamedistribution.com/9cdad5a9a02b4a6daec83566092951ff-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "52",
    "name": "Connect Em All",
    "description": "Play Connect Em All Online and Solve Colorful Dot Puzzles. Connect Em All is an exciting and addictive puzzle game that you can enjoy for free right in your browser. The goal is simple yet surprisingly challenging: connect all the dots of the same color to complete each level. It sounds easy at first, but as the puzzles grow in size and complexity, you will need clever thinking and careful planning to succeed.",
    "url": "https://html5.gamedistribution.com/1f2031ffee5746f990f1dbad0c9d8b61/?gd_sdk_referrer_url=https://gamedistribution.com/games/connect-em-all/",
    "icon": "https://img.gamedistribution.com/1f2031ffee5746f990f1dbad0c9d8b61-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "53",
    "name": "Bomby",
    "description": "Launch into fun with Bomby Birds, a slingshot arcade game inspired by the style of Angry Birds! Pull, aim, and fling your bird through tricky levels filled with blocks and obstacles. Perfect for students searching cool math games, bird games, or quick school break fun. With addictive gameplay, silly physics, and nonstop action, Bomby is the ultimate free kids game for anyone who loves arcade challenges and slingshot adventures!",
    "url": "https://html5.gamedistribution.com/5e9cf0bf87c34232b8e0c1732a605d29/?gd_sdk_referrer_url=https://gamedistribution.com/games/bomby/",
    "icon": "https://img.gamedistribution.com/5e9cf0bf87c34232b8e0c1732a605d29-512x512.jpg",
    "category": "arcade"
  },
  {
    "id": "54",
    "name": "Survival Island: EVO",
    "description": "Play a fun adventure and simulation game in Survival Island: EVO. You are alone on a mysterious island, and the challenge begins: survive, build, and thrive. Gather more resources like food, water, wood, and stone. And craft the tools you need to stay alive. Build your shelter, light a fire, and protect yourself from hunger and wild animals. Explore hidden corners of the island, discover secrets, and unlock new crafting recipes. Become the true survivor.",
    "url": "https://html5.gamedistribution.com/badfffd6951b4bdfa9b5eab7342496ab/?gd_sdk_referrer_url=https://gamedistribution.com/games/survival-island:-evo/",
    "icon": "https://img.gamedistribution.com/badfffd6951b4bdfa9b5eab7342496ab-512x384.jpg",
    "category": "adventure"
  },
  {
    "id": "55",
    "name": "VegaMix Match-3 Village",
    "description": "A cozy match-3 with a heartfelt story! ? Visit grandma in the village — she's a true star with fun tales from her youth. Play classic match-3 levels, earn stars and complete quests for villagers. Bright puzzles, touching stories, colorful graphics and daily bonuses await you. Perfect for short sessions and relaxing breaks. ? For fans of match-3 with plot, coziness and helping heroes.",
    "url": "https://html5.gamedistribution.com/8c1bfbc5d6814c8aa3061061e050b8b4/?gd_sdk_referrer_url=https://gamedistribution.com/games/vegamix-match-3-village/",
    "icon": "https://img.gamedistribution.com/8c1bfbc5d6814c8aa3061061e050b8b4-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "56",
    "name": "Wave Road 3D",
    "description": "Wave Road 3D is a fast-paced reflex game that challenges your focus, timing, and precision. You control a sleek arrow gliding through a floating road filled with gears, traps, and collectible gems. Whether you're chasing high scores in endless mode, conquering 20 handcrafted levels in classic mode, or racing head-to-head with a friend in 2 player mode, Wave Road 3D offers a refreshing and dynamic experience.",
    "url": "https://html5.gamedistribution.com/39f3d521b1134600ad5703502ca9d247/?gd_sdk_referrer_url=https://gamedistribution.com/games/wave-road-3d/",
    "icon": "https://img.gamedistribution.com/39f3d521b1134600ad5703502ca9d247-512x384.jpg",
    "category": "arcade"
  },
  {
    "id": "57",
    "name": "Snow Road Puzzle",
    "description": "Play Snow Road Puzzle — a free online puzzle you can play instantly in your browser, no download needed. Slide icy tiles, carve snowy routes, and solve frosty road puzzles across bite-sized logic levels. Perfect for Cool Math Games fans and unblocked fun at school or home. Fast-loading, mobile-friendly, and zero installs — dive into cozy winter puzzling and endless replay on desktop or phone.",
    "url": "https://html5.gamedistribution.com/a9fdba41525b438baed7ba8b2c842110/?gd_sdk_referrer_url=https://gamedistribution.com/games/snow-road-puzzle/",
    "icon": "https://img.gamedistribution.com/a9fdba41525b438baed7ba8b2c842110-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "58",
    "name": "Run Now",
    "description": "Dive into Run Now, where each step is a puzzle waiting to be solved! This game offers a unique blend of creative challenges, quirky humor, and addictive gameplay. Perfect for puzzle enthusiasts and casual gamers alike, Run Now invites you to test your skills in a world filled with unexpected obstacles and entertaining surprises.",
    "url": "https://html5.gamedistribution.com/332805b21f3c4890bb4258477857b0bb/?gd_sdk_referrer_url=https://gamedistribution.com/games/run-now/",
    "icon": "https://img.gamedistribution.com/332805b21f3c4890bb4258477857b0bb-200x120.jpg",
    "category": "action"
  },
  {
    "id": "59",
    "name": "Powerful Punch",
    "description": "Ready to let off some steam? Powerful Punch is the perfect game to brighten your day and release your frustrations. Rescue the weak, take down villains, and unleash your spooky punch, sprunky punch, or even a spranky punch in levels filled with surprises and hilarity",
    "url": "https://html5.gamedistribution.com/0c9e186c2adf4c52961d042085dfaeb1/?gd_sdk_referrer_url=https://gamedistribution.com/games/powerful-punch/",
    "icon": "https://img.gamedistribution.com/0c9e186c2adf4c52961d042085dfaeb1-512x384.jpg",
    "category": "action"
  },
  {
    "id": "60",
    "name": "Color 3D - Bump It Up",
    "description": "The main principle is pretty simple – you are controlling a small ball that is always moving forward. On your way, there are a few obstacles that you need to get through. There's a small problem however, because you can only touch obstacles that are the same color as your ball. If you touch an obstacle with a different color, the game ends and you need to start from the beginning.",
    "url": "https://html5.gamedistribution.com/c34c0b22a8bd46b494b470ebb47ebb3f/?gd_sdk_referrer_url=https://gamedistribution.com/games/color-3d-bump-it-up/",
    "icon": "https://img.gamedistribution.com/c34c0b22a8bd46b494b470ebb47ebb3f-512x384.jpg",
    "category": "arcade"
  },
  {
    "id": "61",
    "name": "Solitaire Story Tripeaks 6",
    "description": "The highly anticipated 6th installment of one of the most popular Solitaire Story card games of all time! Your good friend Foxy will take you on a journey to new destinations, visiting countries, landscapes, and landmarks like Japan, Egypt, Brazil, Korea, New Zealand, Madagascar, North Pole, and Fiji. With 6700+ levels, Daily Missions, Weekly Air Balloon and Pet Events, and dozens of new card designs, this is the biggest Solitaire Story game yet!",
    "url": "https://html5.gamedistribution.com/06df4062b392479f8a81a4376c5a1c90/?gd_sdk_referrer_url=https://gamedistribution.com/games/solitaire-story-tripeaks-6/",
    "icon": "https://img.gamedistribution.com/06df4062b392479f8a81a4376c5a1c90-512x384.jpg",
    "category": "card"
  },
  {
    "id": "62",
    "name": "Magic and Wizards Mahjong",
    "description": "Enter the enchanting world of Magic & Wizards Mahjong! Match mystical tiles adorned with runes, potions, and magical artifacts across beautifully crafted layouts. Enjoy smooth gameplay with boosters like Hint, Shuffle, Undo, Torch, and Freeze. Race against the clock to earn time bonuses, or use extra seconds to finish your quest. With 50 rotating layouts and stunning wizardly visuals, every match feels like a spellbinding adventure for Mahjong lovers and casual players alike.",
    "url": "https://html5.gamedistribution.com/769f3b2834b94b7ea57a8aa899d93272/?gd_sdk_referrer_url=https://gamedistribution.com/games/magic-and-wizards-mahjong/",
    "icon": "https://img.gamedistribution.com/769f3b2834b94b7ea57a8aa899d93272-1280x550.jpg",
    "category": "puzzle"
  },
  {
    "id": "63",
    "name": "Survival Island: EVO",
    "description": "Play a fun adventure and simulation game in Survival Island: EVO. You are alone on a mysterious island, and the challenge begins: survive, build, and thrive. Gather more resources like food, water, wood, and stone. And craft the tools you need to stay alive. Build your shelter, light a fire, and protect yourself from hunger and wild animals. Explore hidden corners of the island, discover secrets, and unlock new crafting recipes. Become the true survivor.",
    "url": "https://html5.gamedistribution.com/badfffd6951b4bdfa9b5eab7342496ab/?gd_sdk_referrer_url=https://gamedistribution.com/games/survival-island:-evo/",
    "icon": "https://img.gamedistribution.com/badfffd6951b4bdfa9b5eab7342496ab-512x384.jpg",
    "category": "adventure"
  },
  {
    "id": "64",
    "name": "Grow a Garden: Online & Offline",
    "description": "Grow a Garden: Online & Offline – Become the best farmer! Plant, grow, harvest, and earn millions while playing online with other players! Start with a simple plot and turn it into a huge farm with rare and magical plants. Buy seeds from the shop, which refreshes every 5 minutes. Find your plants on the market!",
    "url": "https://html5.gamedistribution.com/f500d997fe1e4b85a3bdfd0f11002942/?gd_sdk_referrer_url=https://gamedistribution.com/games/grow-a-garden:-online-and-offline/",
    "icon": "https://img.gamedistribution.com/f500d997fe1e4b85a3bdfd0f11002942-512x512.jpg",
    "category": "simulation"
  },
  {
    "id": "65",
    "name": "Student and Teacher",
    "description": "The school is not ready for you! Broken laptops, chairs in splinters, the dining room is looted! Revenge is a dish served in the form of chaos! Forget about the silent protest – only crushing anarchy! Make your classmates regret it! The teacher is in a panic! The head teacher is furious! The main thing is not to get caught and avenge the setup!",
    "url": "https://html5.gamedistribution.com/c373cffa43d94eb4bef26b941fc46073/?gd_sdk_referrer_url=https://gamedistribution.com/games/student-and-teacher/",
    "icon": "https://img.gamedistribution.com/c373cffa43d94eb4bef26b941fc46073-512x384.jpg",
    "category": "adventure"
  },
  {
    "id": "66",
    "name": "Farm: Merge Harvest",
    "description": "Transform your land into a beautiful farming haven. Start with a small plot and grow it by merging crops, designing structures and unlocking new areas. The more you build, the more surprises await, bringing new rewards and adventures at every stage!",
    "url": "https://html5.gamedistribution.com/01b4c5438e0c4f17b046a0d1ca94fdae/?gd_sdk_referrer_url=https://gamedistribution.com/games/farm:-merge-harvest/",
    "icon": "https://img.gamedistribution.com/01b4c5438e0c4f17b046a0d1ca94fdae-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "67",
    "name": "Merge Haven",
    "description": "Merge items to restore the café to its former glory, uncover hidden secrets, and discover its mysterious past. Start merging today to reveal the café's enchanting story!",
    "url": "https://html5.gamedistribution.com/4a671eb17a2a44e19b18143242c155fc/?gd_sdk_referrer_url=https://gamedistribution.com/games/merge-haven/",
    "icon": "https://img.gamedistribution.com/4a671eb17a2a44e19b18143242c155fc-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "68",
    "name": "My Arcade Center",
    "description": "In My Arcade Center, play a fun arcade simulation. You build, manage, and grow your very own retro game empire. From humble beginnings to becoming an idle tycoon. You're in control of it all! Buy a few machines and gradually expand your arcade center. Upgrade your games, attract more visitors, and keep the arcade buzzing with activity. Hire staff and enjoy the perfect mix of idle gameplay and management simulation - continuous production of Ultraman to give customers perfect service.",
    "url": "https://html5.gamedistribution.com/6012e9d47c4f4342825c3583e2bb95e2/?gd_sdk_referrer_url=https://gamedistribution.com/games/my-arcade-center/",
    "icon": "https://img.gamedistribution.com/6012e9d47c4f4342825c3583e2bb95e2-512x384.jpg",
    "category": "simulation"
  },
  {
    "id": "69",
    "name": "Last Stand Warrior",
    "description": "A thrilling third-person shooter where you play as an experienced shooter defending your land from endless hordes of enemies. Control the hero, apply precise punches, use skills and fight with waves of mobs to prevent them from breaking through. Upgrade your weapons and abilities to become a true defense champion! Ideal for fans of dynamic gameplay, arcade battles and survival in the «wave of opponents» mode.",
    "url": "https://html5.gamedistribution.com/8141e93045c245ce96ac745c5cb442fe/?gd_sdk_referrer_url=https://gamedistribution.com/games/last-stand-warrior/",
    "icon": "https://img.gamedistribution.com/8141e93045c245ce96ac745c5cb442fe-512x512.jpg",
    "category": "action"
  },
  {
    "id": "70",
    "name": "Head Runner Dash",
    "description": "Head Runner Dash is a 2D platformer game where you need to run, jump, and climb walls to overcome obstacles and traps. Pass the obstacles and raise the flag to complete the level. Difficult levels will make you addicted and feel challenged.",
    "url": "https://html5.gamedistribution.com/68661b4a96164e9aafcba3d856a26065/?gd_sdk_referrer_url=https://gamedistribution.com/games/head-runner-dash/",
    "icon": "https://img.gamedistribution.com/68661b4a96164e9aafcba3d856a26065-512x384.jpg",
    "category": "action"
  },
  {
    "id": "71",
    "name": "Carrom 2 Player",
    "description": "Carrom game is a strike and pocket game similar to billiards, or pools. Here in carrom (also known as karrom or carom) you will use the mouse shoot the pieces. Controls are intuitive to any gamer. You will aim and shoot the disk using your mouse. Try out any zig-zag shots you used to play in a carrom board.",
    "url": "https://html5.gamedistribution.com/31f8ecc60fd84b90b403a11436b29879/?gd_sdk_referrer_url=https://gamedistribution.com/games/carrom-2-player/",
    "icon": "https://img.gamedistribution.com/31f8ecc60fd84b90b403a11436b29879-512x384.jpeg",
    "category": "sports"
  },
  {
    "id": "72",
    "name": "Carrom with Buddies",
    "description": "Revive your childhood dreams by playing Carrom with your buddies. Cover the Queen (Pot the Queen, followed by a Carrommen). Pot all your Karrom pieces with the Queen, covered before the last Carom piece.",
    "url": "https://html5.gamedistribution.com/2350a618041942d1aa5997e2d0a51820/?gd_sdk_referrer_url=https://gamedistribution.com/games/carrom-with-buddies/",
    "icon": "https://img.gamedistribution.com/2350a618041942d1aa5997e2d0a51820-512x512.jpeg",
    "category": "sports"
  },
  {
    "id": "73",
    "name": "Train Surfers",
    "description": "Endless running game, Run - Try Train Surfers, Run as fast as you can! Train Surfing is an amazing running game for runner. Run along the chaos complex traffic and escape from the police, you know how it is in street life. Swipe to turn or use Direction keys or WASD for up, left, down and right respectively or use space bar for jump, jump and slide to avoid hitting obstacles, barrier buses and trains. Have exciting run on Bus 3D, collect coins and buy power up. Unlock new characters, and see how far you can run! Underground city adventure travel along the tracks start now,surf with your friends. Run like hell and challenge your limit. Run - Train Surfing must be a very fun run game. Play it now and start your Run - Train Surfing, join the most thrilling dash.",
    "url": "https://html5.gamedistribution.com/6920e96cea7a4aea956c7410de649a98/?gd_sdk_referrer_url=https://gamedistribution.com/games/train-surfers-1/",
    "icon": "https://img.gamedistribution.com/6920e96cea7a4aea956c7410de649a98-512x384.jpeg",
    "category": "action"
  },
  {
    "id": "74",
    "name": "Rail Blazers Runner",
    "description": "Rail Blazers is on of the best free 3D running games. Run on upto 5 lane monorail and subway tracks, as well as water racing tracks. This running game is packed with fresh and new, original and fun, addicting and captivating play features. Running, Surfing, Racing, Speed boat riding, Flying and Hoverin, as well as, the thrilling Bonus rounds!",
    "url": "https://html5.gamedistribution.com/1bf4a9e0d63b4736b2ccfee207a298d5/?gd_sdk_referrer_url=https://gamedistribution.com/games/rail-blazers-runner/",
    "icon": "https://img.gamedistribution.com/1bf4a9e0d63b4736b2ccfee207a298d5-512x384.jpeg",
    "category": "action"
  },
{
    "id": "75",
    "name": "Mojicon Emoji Connect",
    "description": "A fast, fun twist on classic Onet puzzles! Get ready to match and relax with Mojicon: Emoji Connect – the cheerful tile-linking puzzle bursting with personality! Connect identical emoji tiles, clear the board, and enjoy satisfying spark effects with every perfect match. With hundreds of cute icons, calming backgrounds, and rewarding combos, Mojicon delivers endless relaxing fun for all ages. Play anywhere, anytime – no downloads, just pure emoji joy!",
    "url": "https://html5.gamedistribution.com/b9d470763a744f22a3d5c00d58e56b7f/?gd_sdk_referrer_url=https://gamedistribution.com/games/mojicon-emoji-connect/",
    "icon": "https://img.gamedistribution.com/b9d470763a744f22a3d5c00d58e56b7f-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "76",
    "name": "Hypermarket 3D: Store Cashier",
    "description": "Step into the world of retail and build the supermarket of your dreams! Manage customers, run the cash register, stock shelves, and keep your store thriving. From scanning groceries to cart-surfing adventures, every task brings your bustling market to life. Take charge as the supermarket cashier, master time management, and turn your small store into a thriving grocery empire.",
    "url": "https://html5.gamedistribution.com/32ce4093ac7d48db80abc6befccfca46/?gd_sdk_referrer_url=https://gamedistribution.com/games/hypermarket/",
    "icon": "https://img.gamedistribution.com/32ce4093ac7d48db80abc6befccfca46-512x384.jpg",
    "category": "simulation"
  },
  {
    "id": "77",
    "name": "Brainrot Mega Parkour",
    "description": "Step into the wildest parkour adventure yet. Brainrot Mega Parkour brings together four intense modes, forty handcrafted levels, and a cast of hilarious characters in a single high-speed package. Whether you're climbing an endless tower, racing across a platform full of traps, escaping a rolling lava ball, or surviving a lava flood, every level pushes your reflexes and timing to the limit.",
    "url": "https://html5.gamedistribution.com/52c85b3037d84d5f9fbd7108bc832ccc/?gd_sdk_referrer_url=https://gamedistribution.com/games/brainrot-mega-parkour/",
    "icon": "https://img.gamedistribution.com/52c85b3037d84d5f9fbd7108bc832ccc-512x384.jpg",
    "category": "action"
  },
  {
    "id": "78",
    "name": "Murder Mystery",
    "description": "Murder Mystery – A fast-paced social deduction game. One player is the killer, another the sheriff, the rest are innocents. Use logic, stealth, and quick decisions to survive or expose the murderer. Perfect for high engagement and multiplayer retention.",
    "url": "https://html5.gamedistribution.com/38d45e35b9c24bd0b6029c1be21f0d05/?gd_sdk_referrer_url=https://gamedistribution.com/games/murder-mystery/",
    "icon": "https://img.gamedistribution.com/38d45e35b9c24bd0b6029c1be21f0d05-512x384.jpg",
    "category": "strategy"
  },
  {
    "id": "79",
    "name": "Juicy Match 2",
    "description": "Juicy Match 2 returns with even more natural, fresh, and juicy fun! Step into the best Juice Bar in town and match delicious fruits to create perfect juice blends. Your cheerful Banana friend will guide you with helpful tips along the way. Match three or more fruits to juice them, trigger chain reactions for big bonuses, and master hundreds of new levels. With Daily Missions, Weekly Challenges, and endless juicy puzzles, the adventure never stops in Juicy Match 2!",
    "url": "https://html5.gamedistribution.com/335518c5b7b145288276a0b003dce76f/?gd_sdk_referrer_url=https://gamedistribution.com/games/juicy-match-2/",
    "icon": "https://img.gamedistribution.com/335518c5b7b145288276a0b003dce76f-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "80",
    "name": "VegaMix Match-3 Village",
    "description": "A cozy match-3 with a heartfelt story! ? Visit grandma in the village — she's a true star with fun tales from her youth. Play classic match-3 levels, earn stars and complete quests for villagers. Bright puzzles, touching stories, colorful graphics and daily bonuses await you. Perfect for short sessions and relaxing breaks. ? For fans of match-3 with plot, coziness and helping heroes.",
    "url": "https://html5.gamedistribution.com/8c1bfbc5d6814c8aa3061061e050b8b4/?gd_sdk_referrer_url=https://gamedistribution.com/games/vegamix-match-3-village/",
    "icon": "https://img.gamedistribution.com/8c1bfbc5d6814c8aa3061061e050b8b4-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "81",
    "name": "Pokikex. The Infinite Parasite",
    "description": "You are Pokikex, the hungriest caterpillar in the world! Your destiny is in your legs! Go invade grandpa Joseph' garden! Gobble everything on your way!",
    "url": "https://html5.gamedistribution.com/957524fbcc164a08ad8abca988b76f29/?gd_sdk_referrer_url=https://gamedistribution.com/games/pokikex.-the-infinite-parasite",
    "icon": "https://img.gamedistribution.com/957524fbcc164a08ad8abca988b76f29-1280x720.jpeg",
    "category": "arcade"
  },
  {
    "id": "82",
    "name": "Poke FLY",
    "description": "Bounce the ball remove the walls Higher the score the game is speeding up",
    "url": "http://html5.gamedistribution.com/35173e011d464a27832c76ac22b8a20a/?gd_sdk_referrer_url=https://gamedistribution.com/games/poke-fly/",
    "icon": "https://img.gamedistribution.com/35173e011d464a27832c76ac22b8a20a.jpg",
    "category": "arcade"
  },
  {
    "id": "83",
    "name": "GTA: Grand Vegas Crime",
    "description": "Grand Vegas Crime is an open-world action game set in a sprawling city inspired by Las Vegas. Players take on the role of a daring gangster looking to rise through the criminal underworld. The game offers intense missions, thrilling car chases, and fierce shootouts against rival gangs and law enforcement. Grand Vegas Crime delivers an adrenaline-pumping experience filled with crime, action, and adventure.",
    "url": "https://html5.gamedistribution.com/828864726be944c2bff67fa68d505e96/?gd_sdk_referrer_url=https://gamedistribution.com/games/gta:-grand-vegas-crime/",
    "icon": "https://img.gamedistribution.com/828864726be944c2bff67fa68d505e96-512x384.jpg",
    "category": "action"
  },
  {
    "id": "84",
    "name": "GTA Car Rush",
    "description": "Rev up your engines and dive into the thrilling world of GTA Car Rush, a super fun and free-to-play car chase online game perfect for kids! In this exhilarating adventure, your mission is to collect all the money scattered across each level to unlock new and exciting challenges.",
    "url": "https://html5.gamedistribution.com/f064a3245cf14155b8683fe10511523e/?gd_sdk_referrer_url=https://gamedistribution.com/games/gta-car-rush/",
    "icon": "https://img.gamedistribution.com/f064a3245cf14155b8683fe10511523e-1280x720.jpg",
    "category": "racing"
  }

  
  
]