[
  {
    "id": "1",
    "name": "Vex 9",
    "description": "Vex 9 is here - the next evolution in the legendary stickman platformer series! Take your parkour skills to the limit as you run, jump, and slide your way through a brand-new set of Acts filled with dangerous traps, bombs, and other deadly surprises. For the first time ever, take to the skies with the powerful new Jetpack! Put your reflexes to the ultimate test in the all-new Challenge Mode! Can you conquer every challenge and become the ultimate Vex champion?",
    "url": "https://html5.gamedistribution.com/8d034584a63642dcb89fa3d24ed6e1b1/?gd_sdk_referrer_url=https://gamedistribution.com/games/vex-9/",
    "icon": "https://img.gamedistribution.com/8d034584a63642dcb89fa3d24ed6e1b1-512x384.jpg",
    "category": "action"
  },
  {
    "id": "2",
    "name": "ASMR Pet Treatment",
    "description": "Take care of your adorable puppy and kitty in this relaxing ASMR game! Wash, heal, and pamper your pets with gentle treatments. After they feel happy and healthy, have fun dressing them up in cute outfits. Relaxing sounds and sweet pets make every moment enjoyable!",
    "url": "https://html5.gamedistribution.com/b8075d28037148ec9764c96e3be18bfc/?gd_sdk_referrer_url=https://gamedistribution.com/games/asmr-pet-treatment/",
    "icon": "https://img.gamedistribution.com/b8075d28037148ec9764c96e3be18bfc-512x384.jpg",
    "category": "casual"
  },
  {
    "id": "3",
    "name": "Cookie Land",
    "description": "Step into Cookie Land, the ultimate sweet Match 3 adventure! Match cookies, candies, pies, donuts, cupcakes, and cotton candies to clear the board and trigger scrumptious chain reactions. Explore a fairytale-like saga map filled with colorful sweets, charming graphics, and a catchy soundtrack. With new treats raining down and endless levels of fun, Cookie Land is the most addictive, mouth-watering Match 3 game for all sweet lovers!",
    "url": "https://html5.gamedistribution.com/bb4d392023214827884f92b2a0d68c27/?gd_sdk_referrer_url=https://gamedistribution.com/games/cookie-land/",
    "icon": "https://img.gamedistribution.com/bb4d392023214827884f92b2a0d68c27-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "4",
    "name": "Bubble Shooter Temple Jewels",
    "description": "Embark on a temple adventure in Bubble Shooter Temple Jewels! Pop colorful bubbles as you progress through ancient ruins inspired by Central American temples. Keep track of your journey with the Stats screen, showing your best, current, and previous scores across Novice, Expert, and Master modes. With vibrant visuals, exciting challenges, and detailed progress tracking, this bubble shooter keeps you motivated to aim higher and improve every round!",
    "url": "https://html5.gamedistribution.com/8b43e10dbeb84f7c90e848fb8109d489/?gd_sdk_referrer_url=https://gamedistribution.com/games/bubble-shooter-temple-jewels/",
    "icon": "https://img.gamedistribution.com/8b43e10dbeb84f7c90e848fb8109d489-512x512.jpg",
    "category": "arcade"
  },
  {
    "id": "5",
    "name": "Kings and Queens Mahjong",
    "description": "Enter the magical Royal Kingdom in Kings & Queens Mahjong! Match pairs of jewels, crowns, and other royal treasures to clear the board and climb the Royal Leaderboard. Race against the clock, use boosters like Hint, Shuffle, and Undo when needed, and enjoy handcrafted tiles with a majestic design. Perfect for puzzle lovers looking for a royal challenge!",
    "url": "https://html5.gamedistribution.com/0833c488e0364b15a9feab146f522ddc/?gd_sdk_referrer_url=https://gamedistribution.com/games/kings-and-queens-mahjong/",
    "icon": "https://img.gamedistribution.com/0833c488e0364b15a9feab146f522ddc-512x512.jpg",
    "category": "puzzle"
  },
  
  {
    "id": "6",
    "name": "Hawaii Match 5",
    "description": "Escape to the paradise in Hawaii Match 5! Explore dreamlike landscapes while matching exotic fruits and flowers. With over 4000+ levels, complete challenging goals in limited moves by forming rows of five or more symbols. Unlock powerful boosters and combine symbols for explosive bonuses. Discover hidden treasures and let your soul unwind in this captivating island adventure. Play Hawaii Match 5 now and enjoy endless fun!",
    "url": "https://html5.gamedistribution.com/bfd9e939e8cd458fbb03df9b598959f4/?gd_sdk_referrer_url=https://gamedistribution.com/games/hawaii-match-5/#iss=https%3A%2F%2Fidp.azerionconnect.com%2Fauth%2Frealms%2Fazerion",
    "icon": "https://img.gamedistribution.com/bfd9e939e8cd458fbb03df9b598959f4-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "7",
    "name": "Minecraft Battle Party",
    "description": "Ready for a hot feast of square battles? In Minecraft Battle Party, you'll enter a pixel-styled battle arena where nervous fighting meets iconic Minecraft-style visuals. In this world, every game is a duel to the death. You will play different roles and use different weapons. For example, as a gunner, constantly move your character so that enemies are shot within your scanning range. Watch out for other people's attacks.",
    "url": "https://html5.gamedistribution.com/61217cb6c59e49a29ad154c64ea209de/?gd_sdk_referrer_url=https://gamedistribution.com/games/minecraft-battle-party/",
    "icon": "https://img.gamedistribution.com/61217cb6c59e49a29ad154c64ea209de-512x384.jpg",
    "category": "action"
  },
  {
    "id": "8",
    "name": "Woody Hexa",
    "description": "Woody Hexa is a visually engaging puzzle game that challenges players to complete 250 levels by strategically arranging hexagonal blocks by color. With simple drag-and-drop controls and increasingly complex layouts, each level tests your logic and spatial awareness. Combining relaxing gameplay with clever merging mechanics, Woody Hexa offers a satisfying brain workout perfect for all ages.",
    "url": "https://html5.gamedistribution.com/082c45e1e26f49a2b8ab70fa7aa6b3b7/?gd_sdk_referrer_url=https://gamedistribution.com/games/woody-hexa/",
    "icon": "https://img.gamedistribution.com/082c45e1e26f49a2b8ab70fa7aa6b3b7-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "9",
    "name": "Magic Tiles 3",
    "description": "Love music games? Play your favorite songs on Piano Magic Tiles 3! Magic Tiles 3 is an engaging music game that combines magic piano, rhythm, and games for a fun and immersive experience. Tap the tiles to the beat, challenge your reflexes, and enjoy a massive library of 45,000+ songs across various genres, pop, EDM, hip-hop, and more! Tap the black tiles to the rhythm while avoiding the white ones.",
    "url": "https://html5.gamedistribution.com/58deefb8f63943dcbc5093070b9b5777/?gd_sdk_referrer_url=https://gamedistribution.com/games/magic-tiles-3/",
    "icon": "https://img.gamedistribution.com/58deefb8f63943dcbc5093070b9b5777-512x384.jpg",
    "category": "music"
  },
  {
    "id": "10",
    "name": "Sort Tiles",
    "description": "Sort Tiles: Tap Away is a fun and addictive puzzle game where you move tiles, clear the board, and reveal hidden pictures. It’s simple to learn but offers endless logic challenges that keep your brain active. Perfect for fans of tile puzzles, logic games, and relaxing brain teasers. Key Features: Unique puzzle mechanics — move tiles in the arrow’s direction and solve logic puzzles step by step. Hidden images — every cleared puzzle board reveals a new picture.",
    "url": "https://html5.gamedistribution.com/5d6e368f1b55466aa897cb7f0c67419c/?gd_sdk_referrer_url=https://gamedistribution.com/games/sort-tiles/",
    "icon": "https://img.gamedistribution.com/5d6e368f1b55466aa897cb7f0c67419c-512x384.jpg",
    "category": "puzzle"
  },
{
    "id": "11",
    "name": "Twilight Solitaire TriPeaks",
    "description": "Step into the shadows with Twilight Solitaire TriPeaks! Explore abandoned castles, fend off lurking vampires, and rebuild forgotten halls. Play 200+ haunting Solitaire levels plus 50 chilling Mahjong boards. Face spooky twists like frozen and locked cards, tricky obstacles, and powerful boosts. Search the dark, cobwebby corners of every last level for gems and coins to purchase new castle upgrades and power-ups. Are you ready for a Solitaire adventure that sends shivers down your spine?",
    "url": "https://html5.gamedistribution.com/91eb12a4669543ea825a9e2469143b93/?gd_sdk_referrer_url=https://gamedistribution.com/games/twilight-solitaire-tripeaks/",
    "icon": "https://img.gamedistribution.com/91eb12a4669543ea825a9e2469143b93-512x384.jpg",
    "category": "card"
  },
  {
    "id": "12",
    "name": "Cooking Restaurant Kitchen",
    "description": "Prepare and cook delicious food from all over the world in Cooking Restaurant Kitchen. Build the cafe of your dreams while serving hot and awesome meals to hungry customers at a fast pace! Don't let the time run out, practice your time management skills, and get ready to experience the craze of real cooking!",
    "url": "https://html5.gamedistribution.com/755f3912501d454fb781db0a4c0c5764/?gd_sdk_referrer_url=https://gamedistribution.com/games/cooking-restaurant-kitchen/",
    "icon": "https://img.gamedistribution.com/755f3912501d454fb781db0a4c0c5764-512x384.jpeg",
    "category": "cooking"
  },
  {
    "id": "13",
    "name": "Formula Traffic Racer",
    "description": "Skid the wheels of 6 stunning F1 cars with modified body kits and drive them through 3 landscape highways without crashing. Show how well you can steer the wheels of these amazing cars with roaring engines and conquer 3 awesome game modes. Use replenishing nitro to overtake slow cars and drive in speed at all times. Customize and upgrade your cars with the best upgrades and get the most out of all the cars. Are you ready to show your driving skills? Prove yourself in F1 Traffic Racer.",
    "url": "https://html5.gamedistribution.com/940c7c7f620b46f0ba61998e9a98b8fb/?gd_sdk_referrer_url=https://gamedistribution.com/games/formula-traffic-racer/",
    "icon": "https://img.gamedistribution.com/940c7c7f620b46f0ba61998e9a98b8fb-512x384.jpg",
    "category": "racing"
  },
  {
    "id": "14",
    "name": "Cat Life Simulator: Devil Cat",
    "description": "Ever wanted to experience life as a mischievous cat? In Cat Life Simulator: Devil Cat, you take on the role of a playful yet naughty kitty, causing absolute mayhem inside Grandma’s house—all from a first-person perspective! This exciting 3D simulation game lets you see through the eyes of a troublemaking feline as you knock over furniture, scratch walls, and do everything in your power to drive Grandma crazy! Are you ready to embrace the chaos?",
    "url": "https://html5.gamedistribution.com/61444bd7cc1d42dc9e50d8ea31235f1e/?gd_sdk_referrer_url=https://gamedistribution.com/games/cat-life-simulator:-devil-cat/",
    "icon": "https://img.gamedistribution.com/61444bd7cc1d42dc9e50d8ea31235f1e-1280x720.jpg",
    "category": "simulation"
  },
  {
    "id": "15",
    "name": "Merge Hospital",
    "description": "Play as Doctor Player in Merge Hospital and discover the many secrets of your staff members, and what is happening in and around the Hospital. In Merge Hospital by Operate Now you will merge and build, meet and love many skilled surgeons, doctors and other interesting characters. You will learn more about their stories and how they got into the hospital. As Dr. Player you must: MERGE medical items, pies and much more! DISCOVER the story of a medical drama like in your favorite TV shows.",
    "url": "https://html5.gamedistribution.com/34228dc4cd784e43857cc4c678a83984/?gd_sdk_referrer_url=https://gamedistribution.com/games/merge-hospital/",
    "icon": "https://img.gamedistribution.com/34228dc4cd784e43857cc4c678a83984-512x384.jpg",
    "category": "simulation"
  },
  {
    "id": "16",
    "name": "Obby Tower",
    "description": "Climb. Think. Survive. Ascend a towering obstacle course filled with tricky jumps, moving platforms — and surprise math challenges! Combine your parkour skills with quick thinking to make it to the top. Perfect for players who love obbies and want to test both reflexes and brainpower.",
    "url": "https://html5.gamedistribution.com/62e8b351034b46129fedb50065e06680/?gd_sdk_referrer_url=https://gamedistribution.com/games/obby-tower/",
    "icon": "https://img.gamedistribution.com/62e8b351034b46129fedb50065e06680-512x384.jpg",
    "category": "adventure"
  },
  {
    "id": "17",
    "name": "Mini Golf Battle",
    "description": "Mini Golf Battle is a casual sports puzzle where precision and timing decide the outcome. Your task is to sink the ball into the hole with the fewest strokes possible while navigating ramps, walls, and tricky obstacles. Special power-ups like Fire, Wing, and Spring shots add variety, letting you approach each course with unique strategies. Whether for short play sessions or longer runs, Mini Golf Battle delivers an engaging mix of relaxation and skillful play.",
    "url": "https://html5.gamedistribution.com/f13a0ab3316c4be8b273610a5f2c872c/?gd_sdk_referrer_url=https://gamedistribution.com/games/mini-golf-battle/",
    "icon": "https://img.gamedistribution.com/f13a0ab3316c4be8b273610a5f2c872c-512x384.jpg",
    "category": "sports"
  },
  {
    "id": "18",
    "name": "LinkLink",
    "description": "Round and cute animal blocks are piled up. If you connect the same types together, you can get points by disappearing! Let's compete to see who gets the highest score in a minute!",
    "url": "https://html5.gamedistribution.com/e399b210de7d4db9a5ab7334c5fa0c1b/?gd_sdk_referrer_url=https://gamedistribution.com/games/linklink/",
    "icon": "https://img.gamedistribution.com/e399b210de7d4db9a5ab7334c5fa0c1b-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "19",
    "name": "Dog Escape",
    "description": "Welcome to Dog Escape, the hide-and-seek puzzle where saving a dog is only the beginning. Guide a lost canine through traps and guards, then bring it home to cuddle, feed, and style! If you adore puppy-care, dress-up, and dog games with heart, this is your new daily ritual. Rescue your puppies now!",
    "url": "https://html5.gamedistribution.com/023e7fbb9c874166a76219e0c1f45af0/?gd_sdk_referrer_url=https://gamedistribution.com/games/dog-escape-1/",
    "icon": "https://img.gamedistribution.com/023e7fbb9c874166a76219e0c1f45af0-512x384.jpg",
    "category": "adventure"
  },
  {
    "id": "20",
    "name": "VEX Challenges",
    "description": "Put your skills to the test in Vex Challenges, the newest online Vex game where the timer counts down instead of up. Try to get to the finish within the allotted time, and don’t forget to pick up the stars on the way! Vex Challenges is just as gripping and thrilling as before, but includes a brand new way to play. The game includes 75 custom levels, a hidden Challenge Mode, new skins and a soundtrack that evolves as you progress. It’s Vex like you’ve never seen before!",
    "url": "https://html5.gamedistribution.com/b657d0d7da2e46919d24862aa1f3e758/?gd_sdk_referrer_url=https://gamedistribution.com/games/vex-challenges/",
    "icon": "https://img.gamedistribution.com/b657d0d7da2e46919d24862aa1f3e758-512x384.jpeg",
    "category": "action"
  },


  {
    "id": "21",
    "name": "Aliens Hunter",
    "description": "You are an alien hunter and your mission is to use your abilities to find the aliens hidden in the city and use your gun to accurately shoot the aliens to get rewards. Each round has different aliens hiding in different locations. You have to accurately choose, aim and shoot to complete the level mission.",
    "url": "https://html5.gamedistribution.com/6259b8781bfe4a1dbcd274ca61837902/?gd_sdk_referrer_url=https://gamedistribution.com/games/aliens-hunter/",
    "icon": "https://img.gamedistribution.com/6259b8781bfe4a1dbcd274ca61837902-512x512.jpg",
    "category": "action"
  },
  {
    "id": "22",
    "name": "Car Mechanic Simulator",
    "description": "In \"Car Mechanic Simulator 2025\", you are a master restorer who breathes new life into forgotten cars! Your task is to find old, broken, and abandoned cars, disassemble them down to the last screw, repair them, replace parts, and reassemble them, turning rusty piles of metal into shiny legends of the automotive industry. Search for rare spare parts, restore engines, choose the perfect paint, and bring every detail to perfection.",
    "url": "https://html5.gamedistribution.com/b3d496aa204043c7bb39a355d8c97235/?gd_sdk_referrer_url=https://gamedistribution.com/games/car-mechanic-simulator-2025/",
    "icon": "https://img.gamedistribution.com/b3d496aa204043c7bb39a355d8c97235-512x512.jpg",
    "category": "simulation"
  },
  {
    "id": "23",
    "name": "Merge Beasts",
    "description": "A fun and addictive merge game where you combine cute and quirky beasts to create stronger and rarer creatures. Each merge brings you closer to discovering powerful evolutions and unlocking new surprises. Collect coins, upgrade your beasts, and watch your monster city grow!",
    "url": "https://html5.gamedistribution.com/28f14620b6b4490b8ca14b5ebc684175/?gd_sdk_referrer_url=https://gamedistribution.com/games/merge-beasts/",
    "icon": "https://img.gamedistribution.com/28f14620b6b4490b8ca14b5ebc684175-512x512.jpg",
    "category": "puzzle"
  },
  {
    "id": "24",
    "name": "Noob: parkour tricks",
    "description": "Welcome to Noob: Parkour tricks! This is a runner and timekiller in the minecraft universe about the adventures of Noob. Do parkour tricks and complete challenges. Monster School kicked out Noob, and Herobrine turned him into a Gigachad! Game Features: - Run through the village with trials. - Do parkour tricks. - Complete challenges and avoid traps. - Collect diamonds. - Unlock new skins.",
    "url": "https://html5.gamedistribution.com/f97244f04ed44f83bdae1f71c02361cb/?gd_sdk_referrer_url=https://gamedistribution.com/games/noob:-parkour-tricks/",
    "icon": "https://img.gamedistribution.com/f97244f04ed44f83bdae1f71c02361cb-512x384.jpg",
    "category": "action"
  },
  {
    "id": "25",
    "name": "What's In My Bag?",
    "description": "Unpack style and surprises in What's In My Bag? – the ultimate dress-up and makeup game for fashion lovers! Choose cute outfits, glam makeup, and trendy bags, then reveal what's inside each one. From influencer props to girly goodies, every bag tells a story. Get creative, show off your style, and join the viral \"what's in my bag\" trend now! Perfect for fans of dress-up games, makeup fun, and aesthetic vibes.",
    "url": "https://html5.gamedistribution.com/25ed0a49c8414d8fbd16cbee344b8e5d/?gd_sdk_referrer_url=https://gamedistribution.com/games/what's-in-my-bag/",
    "icon": "https://img.gamedistribution.com/25ed0a49c8414d8fbd16cbee344b8e5d-512x384.jpg",
    "category": "casual"
  },
  {
    "id": "26",
    "name": "Legend of Fireball",
    "description": "Fireballs are your weapon of choice as you tap on objects to obliterate them and earn rewards. Every tap brings you closer to becoming the ultimate Fireball King! Collect various fireballs, costumes, and upgrades, enhancing your powers with every victory. Master cool fireball skills to crush objects even faster and more efficiently. Race against time to demolish all targets in thrilling challenges, proving you're the strongest fireball wielder in the universe!",
    "url": "https://html5.gamedistribution.com/cadf585751cf43dfbc12aa1092186855/?gd_sdk_referrer_url=https://gamedistribution.com/games/legend-of-fireball/",
    "icon": "https://img.gamedistribution.com/cadf585751cf43dfbc12aa1092186855-512x384.jpg",
    "category": "action"
  },
  {
    "id": "27",
    "name": "Tales of Lagoona",
    "description": "Embark on a magical Hidden Object adventure beneath the waves! In Coral Bay, the New Anemone Orphanage is in danger of closing – only you can save it. Search beautiful underwater scenes for hidden treasures, sell your finds at the market, upgrade the orphanage, play 160 mini-games, and take on quests from the townsfolk. Join Islabelle the Mermaid in a heartwarming quest to rescue the orphans!",
    "url": "https://html5.gamedistribution.com/93630196f06f465995df303524c3e706/?gd_sdk_referrer_url=https://gamedistribution.com/games/tales-of-lagoona/",
    "icon": "https://img.gamedistribution.com/93630196f06f465995df303524c3e706-512x512.jpg",
    "category": "puzzle"
  },
  {
    "id": "28",
    "name": "K-Pop Hunter Halloween Fashion",
    "description": "Step into the glamorous world of K-Pop Hunter Halloween Fashion! In this fun dress-up game, you become the ultimate stylist, creating spooky yet stylish looks for popular K-Pop stars. Mix and match Halloween costumes, trendy hairstyles, and cool accessories to design jaw-dropping outfits for the season's most exciting event.",
    "url": "https://html5.gamedistribution.com/7b34855c2eb74532925de32ab10a97d5/?gd_sdk_referrer_url=https://gamedistribution.com/games/k-pop-hunter-halloween-fashion/",
    "icon": "https://img.gamedistribution.com/7b34855c2eb74532925de32ab10a97d5-512x384.jpg",
    "category": "casual"
  },
  {
    "id": "29",
    "name": "Grunge Chic Alt Fashion",
    "description": "Step into the edgy world of Grunge Chic Alt Fashion, where style meets attitude. This dress-up game lets you explore the perfect mix of grunge edge and chic sophistication. From plaid skirts and ripped jeans to oversized jackets, fishnets, and combat boots—you'll have endless options to design your alternative fashion star. Top it off with smoky makeup, bold lipstick, and layered accessories to complete the vibe.",
    "url": "https://html5.gamedistribution.com/78eb21dc67c744fe8ae7fcf97a69d868/?gd_sdk_referrer_url=https://gamedistribution.com/games/grunge-chic-alt-fashion/",
    "icon": "https://img.gamedistribution.com/78eb21dc67c744fe8ae7fcf97a69d868-512x384.jpg",
    "category": "casual"
  },
  {
    "id": "30",
    "name": "Idle Factory Domination",
    "description": "Embark on a journey of industrial dominance in Idle Factory Domination. Click on cells to purchase land, invest in businesses and resources to initiate production, and steadily expand your empire to unlock new territories, all while amassing wealth and asserting your manufacturing prowess.",
    "url": "https://html5.gamedistribution.com/7d900e290aa649859e4780e429323fbc/?gd_sdk_referrer_url=https://gamedistribution.com/games/idle-factory-domination/",
    "icon": "https://img.gamedistribution.com/7d900e290aa649859e4780e429323fbc-1280x720.jpg",
    "category": "simulation"
  },
  {
    "id": "31",
    "name": "Hexa Sort Trick or Treat",
    "description": "Step into a haunted puzzle realm where glowing hexagonal blocks hide within a web of spooky challenges. Your task: sort eerie, color-coded pieces into their rightful places before the shadows close in. With every drag and drop, you'll sharpen your wits and unravel chillingly clever layouts that grow trickier as you progress. Easy to pick up yet devilishly addictive, this Halloween brain-teaser will keep players of all ages spellbound through hundreds of spooky levels.",
    "url": "https://html5.gamedistribution.com/66fddb2022464fce86e045f78db3f46d/?gd_sdk_referrer_url=https://gamedistribution.com/games/hexa-sort-trick-or-treat/",
    "icon": "https://img.gamedistribution.com/66fddb2022464fce86e045f78db3f46d-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "32",
    "name": "Rock Crawling",
    "description": "Welcome to the thrilling world of 3D Rock Crawling Racing, where speed meets strategy and off-road dominance is your only goal. In this high-adrenaline off-road simulator, players take the wheel of powerful 4x4 rock crawlers and navigate some of the most extreme and rugged terrains ever designed in a browser game. From sharp mountain ridges to slippery mud tracks, this is not your average racing game—it's a true test of control, timing, and grit.",
    "url": "https://html5.gamedistribution.com/76f026c1a1054c38b62a350e7bed02bc/?gd_sdk_referrer_url=https://gamedistribution.com/games/rock-crawling/",
    "icon": "https://img.gamedistribution.com/76f026c1a1054c38b62a350e7bed02bc-512x384.jpg",
    "category": "racing"
  },
  {
    "id": "33",
    "name": "Elytra Flight",
    "description": "Elytra Flight is an endless flying adventure inspired by the legendary Elytra wings. Players take to the skies in a fast-paced challenge where reflexes and strategy decide how long they can survive. Whether solo or in 2 player mode, the game blends arcade action with survival mechanics, offering a fresh and rewarding experience every flight.",
    "url": "https://html5.gamedistribution.com/82f6fa2fa66c47b3a0f2b0543cbdfc43/?gd_sdk_referrer_url=https://gamedistribution.com/games/elytra-flight/",
    "icon": "https://img.gamedistribution.com/82f6fa2fa66c47b3a0f2b0543cbdfc43-512x512.jpg",
    "category": "action"
  },
  {
    "id": "34",
    "name": "Among Us Smash",
    "description": "Among Us Smash is a game with Among Us balloons. There is different colors on among us balloons and you need to smash it. Smash all balloons except the blue balloons. You have the right to smash the blue balloons three times. After that the game will end. Be careful because sometimes the balloons come in a group of several balloons and there is a blue balloon hidden between them, so when you smash the others, the blue one will smash as well. Smash as many balloons as you can and get the best result.",
    "url": "https://html5.gamedistribution.com/e08d7d5f87d340cbb1e7a078ee8ff704/?gd_sdk_referrer_url=https://gamedistribution.com/games/among-us-smash/",
    "icon": "https://img.gamedistribution.com/e08d7d5f87d340cbb1e7a078ee8ff704-512x512.jpeg",
    "category": "casual"
  },
  {
    "id": "35",
    "name": "Among Impostor Mahjong Connect",
    "description": "Connect all the among us impostor mahjong tiles and clear the board in this html5 mahjong connection games. You can only connect 2 tiles with the same items with a path with no more than two 90 degree angles. What's the max level can you play?",
    "url": "https://html5.gamedistribution.com/e99c3122c3814c3e95bfb9162030b922/?gd_sdk_referrer_url=https://gamedistribution.com/games/among-impostor-mahjong-connect/",
    "icon": "https://img.gamedistribution.com/e99c3122c3814c3e95bfb9162030b922-512x384.jpeg",
    "category": "puzzle"
  },
  {
    "id": "36",
    "name": "Sprunki Monster Music Beats",
    "description": "Sprunki Monster Music Beats is a music game where popular characters create unique compositions. Combine sounds, create melodies, and enjoy!",
    "url": "https://html5.gamedistribution.com/079570fb4e17431c931dc5f11d4e1886/?gd_sdk_referrer_url=https://gamedistribution.com/games/sprunki-monster-music-beats/",
    "icon": "https://img.gamedistribution.com/079570fb4e17431c931dc5f11d4e1886-512x384.jpg",
    "category": "casual"
  },
  {
    "id": "37",
    "name": "Battle Royale Puzzle Challenge",
    "description": "Battle Royale Puzzle Challenge is a perfect choice for jigsaw puzzle lovers This game is about the famous Fortnite Battle Royale game and it gives you the perfect jigsaw puzzle experience Solve all puzzles and keep your brain sharp You have fur modes for each picture easy medium and hard There is no time limit so you can have a leisurely experience Have fun playing",
    "url": "https://html5.gamedistribution.com/0e462cb3e0804b4dbb34878b7bd1c17e/?gd_sdk_referrer_url=https://gamedistribution.com/games/battle-royale-puzzle-challenge/",
    "icon": "https://img.gamedistribution.com/0e462cb3e0804b4dbb34878b7bd1c17e-512x384.jpeg",
    "category": "puzzle"
  },
  {
    "id": "38",
    "name": "Minecraft Battle Party",
    "description": "Ready for a hot feast of square battles? In Minecraft Battle Party, you'll enter a pixel-styled battle arena where nervous fighting meets iconic Minecraft-style visuals. In this world, every game is a duel to the death. You will play different roles and use different weapons. For example, as a gunner, constantly move your character so that enemies are shot within your scanning range. Watch out for other people's attacks.",
    "url": "https://html5.gamedistribution.com/61217cb6c59e49a29ad154c64ea209de/?gd_sdk_referrer_url=https://gamedistribution.com/games/minecraft-battle-party/",
    "icon": "https://img.gamedistribution.com/61217cb6c59e49a29ad154c64ea209de-512x384.jpg",
    "category": "action"
  },
  {
    "id": "39",
    "name": "Kingdom Defence: Mercenary",
    "description": "This Tower Defence game \"Kingdom Defence: Mercenary\" is the combination of War Games, Magic Weapons, Castle and Guardians with mission of protect The Kingdom and against the aggression of Monster. Your Kingdom is under attack by fearful Monster. In this Tower Defense, you need to react fast and use the right weapons in order to win one of War Games.",
    "url": "https://html5.gamedistribution.com/5c7a89fe84664d79ad57c1a48232c724/?gd_sdk_referrer_url=https://gamedistribution.com/games/kingdom-defence-mercenary/",
    "icon": "https://img.gamedistribution.com/5c7a89fe84664d79ad57c1a48232c724-512x384.jpeg",
    "category": "strategy"
  },
  {
    "id": "40",
    "name": "Ludo Hero",
    "description": "Ludo Hero, modern version of the royal game of Pachisi has arrived. It's a game which was played among Indian kings and queens in ancient times. Roll the Ludo dice and move your tokens to reach the center of the Ludo board. Beat other opponents and become the king of Ludo in this multiplayer game. No complicated login screens. Just enter your username and play against the world. Play with your friends in a 2-player or 4-player mode.",
    "url": "https://html5.gamedistribution.com/951d399995cc4ea5a528c9b7e873066b/?gd_sdk_referrer_url=https://gamedistribution.com/games/ludo-hero/",
    "icon": "https://img.gamedistribution.com/951d399995cc4ea5a528c9b7e873066b-512x384.jpeg",
    "category": "board"
  },
  {
    "id": "41",
    "name": "Patterns",
    "description": "Help Ellie recreate magical patterns using grass, fire, clouds, and more elements as you uncover the hidden order of each level.",
    "url": "https://html5.gamedistribution.com/d2469e2bac9247108bd72573893b76fe/?gd_sdk_referrer_url=https://gamedistribution.com/games/patterns/",
    "icon": "https://img.gamedistribution.com/d2469e2bac9247108bd72573893b76fe-512x512.jpg",
    "category": "puzzle"
  },
  {
    "id": "42",
    "name": "FG Ludo",
    "description": "FG Ludo is fun addictive puzzle game.If you love ludo and want some twist. This game is for you. so enjoy the game.",
    "url": "https://html5.gamedistribution.com/daf0e2fee49d46848145391825c45831/?gd_sdk_referrer_url=https://gamedistribution.com/games/fg-ludo/",
    "icon": "https://img.gamedistribution.com/daf0e2fee49d46848145391825c45831-512x384.jpeg",
    "category": "board"
  },
  {
    "id": "43",
    "name": "Just Ludo",
    "description": "Just Ludo is a tabletop dice board game. Roll the dice and let your chess pieces reach the finish line first, so as to defeat the opponent and win rich rewards. Are you ready for the challenge?",
    "url": "https://html5.gamedistribution.com/a6221e83c05947c198e681edcf5be3d9/?gd_sdk_referrer_url=https://gamedistribution.com/games/just-ludo/",
    "icon": "https://img.gamedistribution.com/a6221e83c05947c198e681edcf5be3d9-512x384.jpg",
    "category": "board"
  }

  
  
]