[
  {
    "id": "1",
    "name": "Vex 9",
    "description": "Vex 9 is here - the next evolution in the legendary stickman platformer series! Take your parkour skills to the limit as you run, jump, and slide your way through a brand-new set of Acts filled with dangerous traps, bombs, and other deadly surprises. For the first time ever, take to the skies with the powerful new Jetpack! Put your reflexes to the ultimate test in the all-new Challenge Mode! Can you conquer every challenge and become the ultimate Vex champion?",
    "url": "https://html5.gamedistribution.com/8d034584a63642dcb89fa3d24ed6e1b1/?gd_sdk_referrer_url=https://gamedistribution.com/games/vex-9/",
    "icon": "https://img.gamedistribution.com/8d034584a63642dcb89fa3d24ed6e1b1-512x384.jpg",
    "category": "action"
  },
  {
    "id": "2",
    "name": "ASMR Pet Treatment",
    "description": "Take care of your adorable puppy and kitty in this relaxing ASMR game! Wash, heal, and pamper your pets with gentle treatments. After they feel happy and healthy, have fun dressing them up in cute outfits. Relaxing sounds and sweet pets make every moment enjoyable!",
    "url": "https://html5.gamedistribution.com/b8075d28037148ec9764c96e3be18bfc/?gd_sdk_referrer_url=https://gamedistribution.com/games/asmr-pet-treatment/",
    "icon": "https://img.gamedistribution.com/b8075d28037148ec9764c96e3be18bfc-512x384.jpg",
    "category": "casual"
  },
  {
    "id": "3",
    "name": "Cookie Land",
    "description": "Step into Cookie Land, the ultimate sweet Match 3 adventure! Match cookies, candies, pies, donuts, cupcakes, and cotton candies to clear the board and trigger scrumptious chain reactions. Explore a fairytale-like saga map filled with colorful sweets, charming graphics, and a catchy soundtrack. With new treats raining down and endless levels of fun, Cookie Land is the most addictive, mouth-watering Match 3 game for all sweet lovers!",
    "url": "https://html5.gamedistribution.com/bb4d392023214827884f92b2a0d68c27/?gd_sdk_referrer_url=https://gamedistribution.com/games/cookie-land/",
    "icon": "https://img.gamedistribution.com/bb4d392023214827884f92b2a0d68c27-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "4",
    "name": "Bubble Shooter Temple Jewels",
    "description": "Embark on a temple adventure in Bubble Shooter Temple Jewels! Pop colorful bubbles as you progress through ancient ruins inspired by Central American temples. Keep track of your journey with the Stats screen, showing your best, current, and previous scores across Novice, Expert, and Master modes. With vibrant visuals, exciting challenges, and detailed progress tracking, this bubble shooter keeps you motivated to aim higher and improve every round!",
    "url": "https://html5.gamedistribution.com/8b43e10dbeb84f7c90e848fb8109d489/?gd_sdk_referrer_url=https://gamedistribution.com/games/bubble-shooter-temple-jewels/",
    "icon": "https://img.gamedistribution.com/8b43e10dbeb84f7c90e848fb8109d489-512x512.jpg",
    "category": "arcade"
  },
  {
    "id": "5",
    "name": "Kings and Queens Mahjong",
    "description": "Enter the magical Royal Kingdom in Kings & Queens Mahjong! Match pairs of jewels, crowns, and other royal treasures to clear the board and climb the Royal Leaderboard. Race against the clock, use boosters like Hint, Shuffle, and Undo when needed, and enjoy handcrafted tiles with a majestic design. Perfect for puzzle lovers looking for a royal challenge!",
    "url": "https://html5.gamedistribution.com/0833c488e0364b15a9feab146f522ddc/?gd_sdk_referrer_url=https://gamedistribution.com/games/kings-and-queens-mahjong/",
    "icon": "https://img.gamedistribution.com/0833c488e0364b15a9feab146f522ddc-512x512.jpg",
    "category": "puzzle"
  },
  
  {
    "id": "6",
    "name": "Hawaii Match 5",
    "description": "Escape to the paradise in Hawaii Match 5! Explore dreamlike landscapes while matching exotic fruits and flowers. With over 4000+ levels, complete challenging goals in limited moves by forming rows of five or more symbols. Unlock powerful boosters and combine symbols for explosive bonuses. Discover hidden treasures and let your soul unwind in this captivating island adventure. Play Hawaii Match 5 now and enjoy endless fun!",
    "url": "https://html5.gamedistribution.com/bfd9e939e8cd458fbb03df9b598959f4/?gd_sdk_referrer_url=https://gamedistribution.com/games/hawaii-match-5/#iss=https%3A%2F%2Fidp.azerionconnect.com%2Fauth%2Frealms%2Fazerion",
    "icon": "https://img.gamedistribution.com/bfd9e939e8cd458fbb03df9b598959f4-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "7",
    "name": "Minecraft Battle Party",
    "description": "Ready for a hot feast of square battles? In Minecraft Battle Party, you'll enter a pixel-styled battle arena where nervous fighting meets iconic Minecraft-style visuals. In this world, every game is a duel to the death. You will play different roles and use different weapons. For example, as a gunner, constantly move your character so that enemies are shot within your scanning range. Watch out for other people's attacks.",
    "url": "https://html5.gamedistribution.com/61217cb6c59e49a29ad154c64ea209de/?gd_sdk_referrer_url=https://gamedistribution.com/games/minecraft-battle-party/",
    "icon": "https://img.gamedistribution.com/61217cb6c59e49a29ad154c64ea209de-512x384.jpg",
    "category": "action"
  },
  {
    "id": "8",
    "name": "Woody Hexa",
    "description": "Woody Hexa is a visually engaging puzzle game that challenges players to complete 250 levels by strategically arranging hexagonal blocks by color. With simple drag-and-drop controls and increasingly complex layouts, each level tests your logic and spatial awareness. Combining relaxing gameplay with clever merging mechanics, Woody Hexa offers a satisfying brain workout perfect for all ages.",
    "url": "https://html5.gamedistribution.com/082c45e1e26f49a2b8ab70fa7aa6b3b7/?gd_sdk_referrer_url=https://gamedistribution.com/games/woody-hexa/",
    "icon": "https://img.gamedistribution.com/082c45e1e26f49a2b8ab70fa7aa6b3b7-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "9",
    "name": "Magic Tiles 3",
    "description": "Love music games? Play your favorite songs on Piano Magic Tiles 3! Magic Tiles 3 is an engaging music game that combines magic piano, rhythm, and games for a fun and immersive experience. Tap the tiles to the beat, challenge your reflexes, and enjoy a massive library of 45,000+ songs across various genres, pop, EDM, hip-hop, and more! Tap the black tiles to the rhythm while avoiding the white ones.",
    "url": "https://html5.gamedistribution.com/58deefb8f63943dcbc5093070b9b5777/?gd_sdk_referrer_url=https://gamedistribution.com/games/magic-tiles-3/",
    "icon": "https://img.gamedistribution.com/58deefb8f63943dcbc5093070b9b5777-512x384.jpg",
    "category": "music"
  },
  {
    "id": "10",
    "name": "Sort Tiles",
    "description": "Sort Tiles: Tap Away is a fun and addictive puzzle game where you move tiles, clear the board, and reveal hidden pictures. It’s simple to learn but offers endless logic challenges that keep your brain active. Perfect for fans of tile puzzles, logic games, and relaxing brain teasers. Key Features: Unique puzzle mechanics — move tiles in the arrow’s direction and solve logic puzzles step by step. Hidden images — every cleared puzzle board reveals a new picture.",
    "url": "https://html5.gamedistribution.com/5d6e368f1b55466aa897cb7f0c67419c/?gd_sdk_referrer_url=https://gamedistribution.com/games/sort-tiles/",
    "icon": "https://img.gamedistribution.com/5d6e368f1b55466aa897cb7f0c67419c-512x384.jpg",
    "category": "puzzle"
  },
{
    "id": "11",
    "name": "Twilight Solitaire TriPeaks",
    "description": "Step into the shadows with Twilight Solitaire TriPeaks! Explore abandoned castles, fend off lurking vampires, and rebuild forgotten halls. Play 200+ haunting Solitaire levels plus 50 chilling Mahjong boards. Face spooky twists like frozen and locked cards, tricky obstacles, and powerful boosts. Search the dark, cobwebby corners of every last level for gems and coins to purchase new castle upgrades and power-ups. Are you ready for a Solitaire adventure that sends shivers down your spine?",
    "url": "https://html5.gamedistribution.com/91eb12a4669543ea825a9e2469143b93/?gd_sdk_referrer_url=https://gamedistribution.com/games/twilight-solitaire-tripeaks/",
    "icon": "https://img.gamedistribution.com/91eb12a4669543ea825a9e2469143b93-512x384.jpg",
    "category": "card"
  },
  {
    "id": "12",
    "name": "Cooking Restaurant Kitchen",
    "description": "Prepare and cook delicious food from all over the world in Cooking Restaurant Kitchen. Build the cafe of your dreams while serving hot and awesome meals to hungry customers at a fast pace! Don't let the time run out, practice your time management skills, and get ready to experience the craze of real cooking!",
    "url": "https://html5.gamedistribution.com/755f3912501d454fb781db0a4c0c5764/?gd_sdk_referrer_url=https://gamedistribution.com/games/cooking-restaurant-kitchen/",
    "icon": "https://img.gamedistribution.com/755f3912501d454fb781db0a4c0c5764-512x384.jpeg",
    "category": "cooking"
  },
  {
    "id": "13",
    "name": "Formula Traffic Racer",
    "description": "Skid the wheels of 6 stunning F1 cars with modified body kits and drive them through 3 landscape highways without crashing. Show how well you can steer the wheels of these amazing cars with roaring engines and conquer 3 awesome game modes. Use replenishing nitro to overtake slow cars and drive in speed at all times. Customize and upgrade your cars with the best upgrades and get the most out of all the cars. Are you ready to show your driving skills? Prove yourself in F1 Traffic Racer.",
    "url": "https://html5.gamedistribution.com/940c7c7f620b46f0ba61998e9a98b8fb/?gd_sdk_referrer_url=https://gamedistribution.com/games/formula-traffic-racer/",
    "icon": "https://img.gamedistribution.com/940c7c7f620b46f0ba61998e9a98b8fb-512x384.jpg",
    "category": "racing"
  },
  {
    "id": "14",
    "name": "Cat Life Simulator: Devil Cat",
    "description": "Ever wanted to experience life as a mischievous cat? In Cat Life Simulator: Devil Cat, you take on the role of a playful yet naughty kitty, causing absolute mayhem inside Grandma’s house—all from a first-person perspective! This exciting 3D simulation game lets you see through the eyes of a troublemaking feline as you knock over furniture, scratch walls, and do everything in your power to drive Grandma crazy! Are you ready to embrace the chaos?",
    "url": "https://html5.gamedistribution.com/61444bd7cc1d42dc9e50d8ea31235f1e/?gd_sdk_referrer_url=https://gamedistribution.com/games/cat-life-simulator:-devil-cat/",
    "icon": "https://img.gamedistribution.com/61444bd7cc1d42dc9e50d8ea31235f1e-1280x720.jpg",
    "category": "simulation"
  },
  {
    "id": "15",
    "name": "Merge Hospital",
    "description": "Play as Doctor Player in Merge Hospital and discover the many secrets of your staff members, and what is happening in and around the Hospital. In Merge Hospital by Operate Now you will merge and build, meet and love many skilled surgeons, doctors and other interesting characters. You will learn more about their stories and how they got into the hospital. As Dr. Player you must: MERGE medical items, pies and much more! DISCOVER the story of a medical drama like in your favorite TV shows.",
    "url": "https://html5.gamedistribution.com/34228dc4cd784e43857cc4c678a83984/?gd_sdk_referrer_url=https://gamedistribution.com/games/merge-hospital/",
    "icon": "https://img.gamedistribution.com/34228dc4cd784e43857cc4c678a83984-512x384.jpg",
    "category": "simulation"
  },
  {
    "id": "16",
    "name": "Obby Tower",
    "description": "Climb. Think. Survive. Ascend a towering obstacle course filled with tricky jumps, moving platforms — and surprise math challenges! Combine your parkour skills with quick thinking to make it to the top. Perfect for players who love obbies and want to test both reflexes and brainpower.",
    "url": "https://html5.gamedistribution.com/62e8b351034b46129fedb50065e06680/?gd_sdk_referrer_url=https://gamedistribution.com/games/obby-tower/",
    "icon": "https://img.gamedistribution.com/62e8b351034b46129fedb50065e06680-512x384.jpg",
    "category": "adventure"
  },
  {
    "id": "17",
    "name": "Mini Golf Battle",
    "description": "Mini Golf Battle is a casual sports puzzle where precision and timing decide the outcome. Your task is to sink the ball into the hole with the fewest strokes possible while navigating ramps, walls, and tricky obstacles. Special power-ups like Fire, Wing, and Spring shots add variety, letting you approach each course with unique strategies. Whether for short play sessions or longer runs, Mini Golf Battle delivers an engaging mix of relaxation and skillful play.",
    "url": "https://html5.gamedistribution.com/f13a0ab3316c4be8b273610a5f2c872c/?gd_sdk_referrer_url=https://gamedistribution.com/games/mini-golf-battle/",
    "icon": "https://img.gamedistribution.com/f13a0ab3316c4be8b273610a5f2c872c-512x384.jpg",
    "category": "sports"
  },
  {
    "id": "18",
    "name": "LinkLink",
    "description": "Round and cute animal blocks are piled up. If you connect the same types together, you can get points by disappearing! Let's compete to see who gets the highest score in a minute!",
    "url": "https://html5.gamedistribution.com/e399b210de7d4db9a5ab7334c5fa0c1b/?gd_sdk_referrer_url=https://gamedistribution.com/games/linklink/",
    "icon": "https://img.gamedistribution.com/e399b210de7d4db9a5ab7334c5fa0c1b-512x384.jpg",
    "category": "puzzle"
  },
  {
    "id": "19",
    "name": "Dog Escape",
    "description": "Welcome to Dog Escape, the hide-and-seek puzzle where saving a dog is only the beginning. Guide a lost canine through traps and guards, then bring it home to cuddle, feed, and style! If you adore puppy-care, dress-up, and dog games with heart, this is your new daily ritual. Rescue your puppies now!",
    "url": "https://html5.gamedistribution.com/023e7fbb9c874166a76219e0c1f45af0/?gd_sdk_referrer_url=https://gamedistribution.com/games/dog-escape-1/",
    "icon": "https://img.gamedistribution.com/023e7fbb9c874166a76219e0c1f45af0-512x384.jpg",
    "category": "adventure"
  },
  {
    "id": "20",
    "name": "VEX Challenges",
    "description": "Put your skills to the test in Vex Challenges, the newest online Vex game where the timer counts down instead of up. Try to get to the finish within the allotted time, and don’t forget to pick up the stars on the way! Vex Challenges is just as gripping and thrilling as before, but includes a brand new way to play. The game includes 75 custom levels, a hidden Challenge Mode, new skins and a soundtrack that evolves as you progress. It’s Vex like you’ve never seen before!",
    "url": "https://html5.gamedistribution.com/b657d0d7da2e46919d24862aa1f3e758/?gd_sdk_referrer_url=https://gamedistribution.com/games/vex-challenges/",
    "icon": "https://img.gamedistribution.com/b657d0d7da2e46919d24862aa1f3e758-512x384.jpeg",
    "category": "action"
  }

  
  
]